/* automatically generated by rust-bindgen 0.55.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align> {
    storage: Storage,
    align: [Align; 0],
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage, align: [] }
    }
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]

pub type ma_handle = *mut libc::c_void;
pub type ma_ptr = *mut libc::c_void;
pub type ma_proc = ::core::option::Option<unsafe extern "C" fn()>;
pub type ma_channel = ma_uint8;
pub type ma_result = libc::c_int;
pub const ma_stream_format_pcm: ma_stream_format = 0;
pub type ma_stream_format = libc::c_int;
pub const ma_stream_layout_interleaved: ma_stream_layout = 0;
pub const ma_stream_layout_deinterleaved: ma_stream_layout = 1;
pub type ma_stream_layout = libc::c_int;
pub const ma_dither_mode_none: ma_dither_mode = 0;
pub const ma_dither_mode_rectangle: ma_dither_mode = 1;
pub const ma_dither_mode_triangle: ma_dither_mode = 2;
pub type ma_dither_mode = libc::c_int;
pub const ma_format_unknown: ma_format = 0;
pub const ma_format_u8: ma_format = 1;
pub const ma_format_s16: ma_format = 2;
pub const ma_format_s24: ma_format = 3;
pub const ma_format_s32: ma_format = 4;
pub const ma_format_f32: ma_format = 5;
pub const ma_format_count: ma_format = 6;
pub type ma_format = libc::c_int;
pub const ma_channel_mix_mode_rectangular: ma_channel_mix_mode = 0;
pub const ma_channel_mix_mode_simple: ma_channel_mix_mode = 1;
pub const ma_channel_mix_mode_custom_weights: ma_channel_mix_mode = 2;
pub const ma_channel_mix_mode_planar_blend: ma_channel_mix_mode = 0;
pub const ma_channel_mix_mode_default: ma_channel_mix_mode = 0;
pub type ma_channel_mix_mode = libc::c_int;
pub const ma_standard_channel_map_microsoft: ma_standard_channel_map = 0;
pub const ma_standard_channel_map_alsa: ma_standard_channel_map = 1;
pub const ma_standard_channel_map_rfc3551: ma_standard_channel_map = 2;
pub const ma_standard_channel_map_flac: ma_standard_channel_map = 3;
pub const ma_standard_channel_map_vorbis: ma_standard_channel_map = 4;
pub const ma_standard_channel_map_sound4: ma_standard_channel_map = 5;
pub const ma_standard_channel_map_sndio: ma_standard_channel_map = 6;
pub const ma_standard_channel_map_webaudio: ma_standard_channel_map = 3;
pub const ma_standard_channel_map_default: ma_standard_channel_map = 0;
pub type ma_standard_channel_map = libc::c_int;
pub const ma_performance_profile_low_latency: ma_performance_profile = 0;
pub const ma_performance_profile_conservative: ma_performance_profile = 1;
pub type ma_performance_profile = libc::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_allocation_callbacks {
    pub pUserData: *mut libc::c_void,
    pub onMalloc: ::core::option::Option<
        unsafe extern "C" fn(sz: usize, pUserData: *mut libc::c_void) -> *mut libc::c_void,
    >,
    pub onRealloc: ::core::option::Option<
        unsafe extern "C" fn(
            p: *mut libc::c_void,
            sz: usize,
            pUserData: *mut libc::c_void,
        ) -> *mut libc::c_void,
    >,
    pub onFree: ::core::option::Option<
        unsafe extern "C" fn(p: *mut libc::c_void, pUserData: *mut libc::c_void),
    >,
}
#[test]
fn bindgen_test_layout_ma_allocation_callbacks() {
    assert_eq!(
        ::core::mem::size_of::<ma_allocation_callbacks>(),
        32usize,
        concat!("Size of: ", stringify!(ma_allocation_callbacks))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_allocation_callbacks>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_allocation_callbacks))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_allocation_callbacks>())).pUserData as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_allocation_callbacks),
            "::",
            stringify!(pUserData)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_allocation_callbacks>())).onMalloc as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_allocation_callbacks),
            "::",
            stringify!(onMalloc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_allocation_callbacks>())).onRealloc as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_allocation_callbacks),
            "::",
            stringify!(onRealloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_allocation_callbacks>())).onFree as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_allocation_callbacks),
            "::",
            stringify!(onFree)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_lcg {
    pub state: ma_int32,
}
#[test]
fn bindgen_test_layout_ma_lcg() {
    assert_eq!(
        ::core::mem::size_of::<ma_lcg>(),
        4usize,
        concat!("Size of: ", stringify!(ma_lcg))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_lcg>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_lcg))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lcg>())).state as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lcg),
            "::",
            stringify!(state)
        )
    );
}
pub const ma_thread_priority_idle: ma_thread_priority = -5;
pub const ma_thread_priority_lowest: ma_thread_priority = -4;
pub const ma_thread_priority_low: ma_thread_priority = -3;
pub const ma_thread_priority_normal: ma_thread_priority = -2;
pub const ma_thread_priority_high: ma_thread_priority = -1;
pub const ma_thread_priority_highest: ma_thread_priority = 0;
pub const ma_thread_priority_realtime: ma_thread_priority = 1;
pub const ma_thread_priority_default: ma_thread_priority = 0;
pub type ma_thread_priority = libc::c_int;
pub type ma_spinlock = libc::c_uchar;
pub type ma_thread = ma_handle;
pub type ma_mutex = ma_handle;
pub type ma_event = ma_handle;
pub type ma_semaphore = ma_handle;
extern "C" {
    pub fn ma_version(pMajor: *mut ma_uint32, pMinor: *mut ma_uint32, pRevision: *mut ma_uint32);
}
extern "C" {
    pub fn ma_version_string() -> *const libc::c_char;
}
#[doc = "Biquad Filtering"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_biquad_coefficient {
    pub f32_: f32,
    pub s32: ma_int32,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_ma_biquad_coefficient() {
    assert_eq!(
        ::core::mem::size_of::<ma_biquad_coefficient>(),
        4usize,
        concat!("Size of: ", stringify!(ma_biquad_coefficient))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_biquad_coefficient>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_biquad_coefficient))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_biquad_coefficient>())).f32_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad_coefficient),
            "::",
            stringify!(f32_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_biquad_coefficient>())).s32 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad_coefficient),
            "::",
            stringify!(s32)
        )
    );
}
impl ::core::fmt::Debug for ma_biquad_coefficient {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "ma_biquad_coefficient {{ union }}")
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_biquad_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub b0: f64,
    pub b1: f64,
    pub b2: f64,
    pub a0: f64,
    pub a1: f64,
    pub a2: f64,
}
#[test]
fn bindgen_test_layout_ma_biquad_config() {
    assert_eq!(
        ::core::mem::size_of::<ma_biquad_config>(),
        56usize,
        concat!("Size of: ", stringify!(ma_biquad_config))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_biquad_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_biquad_config))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_biquad_config>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_biquad_config>())).channels as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_biquad_config>())).b0 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad_config),
            "::",
            stringify!(b0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_biquad_config>())).b1 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad_config),
            "::",
            stringify!(b1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_biquad_config>())).b2 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad_config),
            "::",
            stringify!(b2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_biquad_config>())).a0 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad_config),
            "::",
            stringify!(a0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_biquad_config>())).a1 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad_config),
            "::",
            stringify!(a1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_biquad_config>())).a2 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad_config),
            "::",
            stringify!(a2)
        )
    );
}
extern "C" {
    pub fn ma_biquad_config_init(
        format: ma_format,
        channels: ma_uint32,
        b0: f64,
        b1: f64,
        b2: f64,
        a0: f64,
        a1: f64,
        a2: f64,
    ) -> ma_biquad_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_biquad {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub b0: ma_biquad_coefficient,
    pub b1: ma_biquad_coefficient,
    pub b2: ma_biquad_coefficient,
    pub a1: ma_biquad_coefficient,
    pub a2: ma_biquad_coefficient,
    pub r1: [ma_biquad_coefficient; 32usize],
    pub r2: [ma_biquad_coefficient; 32usize],
}
#[test]
fn bindgen_test_layout_ma_biquad() {
    assert_eq!(
        ::core::mem::size_of::<ma_biquad>(),
        284usize,
        concat!("Size of: ", stringify!(ma_biquad))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_biquad>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_biquad))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_biquad>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_biquad>())).channels as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_biquad>())).b0 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad),
            "::",
            stringify!(b0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_biquad>())).b1 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad),
            "::",
            stringify!(b1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_biquad>())).b2 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad),
            "::",
            stringify!(b2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_biquad>())).a1 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad),
            "::",
            stringify!(a1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_biquad>())).a2 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad),
            "::",
            stringify!(a2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_biquad>())).r1 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad),
            "::",
            stringify!(r1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_biquad>())).r2 as *const _ as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_biquad),
            "::",
            stringify!(r2)
        )
    );
}
impl ::core::fmt::Debug for ma_biquad {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write ! (f , "ma_biquad {{ format: {:?}, channels: {:?}, b0: {:?}, b1: {:?}, b2: {:?}, a1: {:?}, a2: {:?}, r1: [...], r2: [...] }}" , self . format , self . channels , self . b0 , self . b1 , self . b2 , self . a1 , self . a2)
    }
}
extern "C" {
    pub fn ma_biquad_init(pConfig: *const ma_biquad_config, pBQ: *mut ma_biquad) -> ma_result;
}
extern "C" {
    pub fn ma_biquad_reinit(pConfig: *const ma_biquad_config, pBQ: *mut ma_biquad) -> ma_result;
}
extern "C" {
    pub fn ma_biquad_process_pcm_frames(
        pBQ: *mut ma_biquad,
        pFramesOut: *mut libc::c_void,
        pFramesIn: *const libc::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_biquad_get_latency(pBQ: *mut ma_biquad) -> ma_uint32;
}
#[doc = "Low-Pass Filtering"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_lpf1_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub q: f64,
}
#[test]
fn bindgen_test_layout_ma_lpf1_config() {
    assert_eq!(
        ::core::mem::size_of::<ma_lpf1_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_lpf1_config))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_lpf1_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_lpf1_config))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf1_config>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf1_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf1_config>())).channels as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf1_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf1_config>())).sampleRate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf1_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf1_config>())).cutoffFrequency as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf1_config),
            "::",
            stringify!(cutoffFrequency)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf1_config>())).q as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf1_config),
            "::",
            stringify!(q)
        )
    );
}
#[doc = "Low-Pass Filtering"]
pub type ma_lpf2_config = ma_lpf1_config;
extern "C" {
    pub fn ma_lpf1_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
    ) -> ma_lpf1_config;
}
extern "C" {
    pub fn ma_lpf2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        q: f64,
    ) -> ma_lpf2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_lpf1 {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub a: ma_biquad_coefficient,
    pub r1: [ma_biquad_coefficient; 32usize],
}
#[test]
fn bindgen_test_layout_ma_lpf1() {
    assert_eq!(
        ::core::mem::size_of::<ma_lpf1>(),
        140usize,
        concat!("Size of: ", stringify!(ma_lpf1))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_lpf1>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_lpf1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf1>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf1),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf1>())).channels as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf1),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf1>())).a as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf1),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf1>())).r1 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf1),
            "::",
            stringify!(r1)
        )
    );
}
impl ::core::fmt::Debug for ma_lpf1 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "ma_lpf1 {{ format: {:?}, channels: {:?}, a: {:?}, r1: [...] }}",
            self.format, self.channels, self.a
        )
    }
}
extern "C" {
    pub fn ma_lpf1_init(pConfig: *const ma_lpf1_config, pLPF: *mut ma_lpf1) -> ma_result;
}
extern "C" {
    pub fn ma_lpf1_reinit(pConfig: *const ma_lpf1_config, pLPF: *mut ma_lpf1) -> ma_result;
}
extern "C" {
    pub fn ma_lpf1_process_pcm_frames(
        pLPF: *mut ma_lpf1,
        pFramesOut: *mut libc::c_void,
        pFramesIn: *const libc::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf1_get_latency(pLPF: *mut ma_lpf1) -> ma_uint32;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_lpf2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_lpf2() {
    assert_eq!(
        ::core::mem::size_of::<ma_lpf2>(),
        284usize,
        concat!("Size of: ", stringify!(ma_lpf2))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_lpf2>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_lpf2))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf2>())).bq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf2),
            "::",
            stringify!(bq)
        )
    );
}
impl ::core::fmt::Debug for ma_lpf2 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "ma_lpf2 {{ bq: {:?} }}", self.bq)
    }
}
extern "C" {
    pub fn ma_lpf2_init(pConfig: *const ma_lpf2_config, pLPF: *mut ma_lpf2) -> ma_result;
}
extern "C" {
    pub fn ma_lpf2_reinit(pConfig: *const ma_lpf2_config, pLPF: *mut ma_lpf2) -> ma_result;
}
extern "C" {
    pub fn ma_lpf2_process_pcm_frames(
        pLPF: *mut ma_lpf2,
        pFramesOut: *mut libc::c_void,
        pFramesIn: *const libc::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf2_get_latency(pLPF: *mut ma_lpf2) -> ma_uint32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_lpf_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub order: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_lpf_config() {
    assert_eq!(
        ::core::mem::size_of::<ma_lpf_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_lpf_config))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_lpf_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_lpf_config))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf_config>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf_config>())).channels as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf_config>())).sampleRate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf_config>())).cutoffFrequency as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf_config),
            "::",
            stringify!(cutoffFrequency)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf_config>())).order as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf_config),
            "::",
            stringify!(order)
        )
    );
}
extern "C" {
    pub fn ma_lpf_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        order: ma_uint32,
    ) -> ma_lpf_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_lpf {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub lpf1Count: ma_uint32,
    pub lpf2Count: ma_uint32,
    pub lpf1: [ma_lpf1; 1usize],
    pub lpf2: [ma_lpf2; 4usize],
}
#[test]
fn bindgen_test_layout_ma_lpf() {
    assert_eq!(
        ::core::mem::size_of::<ma_lpf>(),
        1296usize,
        concat!("Size of: ", stringify!(ma_lpf))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_lpf>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_lpf))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf>())).channels as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf>())).sampleRate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf>())).lpf1Count as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf),
            "::",
            stringify!(lpf1Count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf>())).lpf2Count as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf),
            "::",
            stringify!(lpf2Count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf>())).lpf1 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf),
            "::",
            stringify!(lpf1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_lpf>())).lpf2 as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_lpf),
            "::",
            stringify!(lpf2)
        )
    );
}
impl ::core::fmt::Debug for ma_lpf {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write ! (f , "ma_lpf {{ format: {:?}, channels: {:?}, sampleRate: {:?}, lpf1Count: {:?}, lpf2Count: {:?}, lpf1: {:?}, lpf2: {:?} }}" , self . format , self . channels , self . sampleRate , self . lpf1Count , self . lpf2Count , self . lpf1 , self . lpf2)
    }
}
extern "C" {
    pub fn ma_lpf_init(pConfig: *const ma_lpf_config, pLPF: *mut ma_lpf) -> ma_result;
}
extern "C" {
    pub fn ma_lpf_reinit(pConfig: *const ma_lpf_config, pLPF: *mut ma_lpf) -> ma_result;
}
extern "C" {
    pub fn ma_lpf_process_pcm_frames(
        pLPF: *mut ma_lpf,
        pFramesOut: *mut libc::c_void,
        pFramesIn: *const libc::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf_get_latency(pLPF: *mut ma_lpf) -> ma_uint32;
}
#[doc = "High-Pass Filtering"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_hpf1_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub q: f64,
}
#[test]
fn bindgen_test_layout_ma_hpf1_config() {
    assert_eq!(
        ::core::mem::size_of::<ma_hpf1_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_hpf1_config))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_hpf1_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_hpf1_config))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf1_config>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf1_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf1_config>())).channels as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf1_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf1_config>())).sampleRate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf1_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf1_config>())).cutoffFrequency as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf1_config),
            "::",
            stringify!(cutoffFrequency)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf1_config>())).q as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf1_config),
            "::",
            stringify!(q)
        )
    );
}
#[doc = "High-Pass Filtering"]
pub type ma_hpf2_config = ma_hpf1_config;
extern "C" {
    pub fn ma_hpf1_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
    ) -> ma_hpf1_config;
}
extern "C" {
    pub fn ma_hpf2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        q: f64,
    ) -> ma_hpf2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_hpf1 {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub a: ma_biquad_coefficient,
    pub r1: [ma_biquad_coefficient; 32usize],
}
#[test]
fn bindgen_test_layout_ma_hpf1() {
    assert_eq!(
        ::core::mem::size_of::<ma_hpf1>(),
        140usize,
        concat!("Size of: ", stringify!(ma_hpf1))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_hpf1>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_hpf1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf1>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf1),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf1>())).channels as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf1),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf1>())).a as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf1),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf1>())).r1 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf1),
            "::",
            stringify!(r1)
        )
    );
}
impl ::core::fmt::Debug for ma_hpf1 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "ma_hpf1 {{ format: {:?}, channels: {:?}, a: {:?}, r1: [...] }}",
            self.format, self.channels, self.a
        )
    }
}
extern "C" {
    pub fn ma_hpf1_init(pConfig: *const ma_hpf1_config, pHPF: *mut ma_hpf1) -> ma_result;
}
extern "C" {
    pub fn ma_hpf1_reinit(pConfig: *const ma_hpf1_config, pHPF: *mut ma_hpf1) -> ma_result;
}
extern "C" {
    pub fn ma_hpf1_process_pcm_frames(
        pHPF: *mut ma_hpf1,
        pFramesOut: *mut libc::c_void,
        pFramesIn: *const libc::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf1_get_latency(pHPF: *mut ma_hpf1) -> ma_uint32;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_hpf2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_hpf2() {
    assert_eq!(
        ::core::mem::size_of::<ma_hpf2>(),
        284usize,
        concat!("Size of: ", stringify!(ma_hpf2))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_hpf2>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_hpf2))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf2>())).bq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf2),
            "::",
            stringify!(bq)
        )
    );
}
impl ::core::fmt::Debug for ma_hpf2 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "ma_hpf2 {{ bq: {:?} }}", self.bq)
    }
}
extern "C" {
    pub fn ma_hpf2_init(pConfig: *const ma_hpf2_config, pHPF: *mut ma_hpf2) -> ma_result;
}
extern "C" {
    pub fn ma_hpf2_reinit(pConfig: *const ma_hpf2_config, pHPF: *mut ma_hpf2) -> ma_result;
}
extern "C" {
    pub fn ma_hpf2_process_pcm_frames(
        pHPF: *mut ma_hpf2,
        pFramesOut: *mut libc::c_void,
        pFramesIn: *const libc::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf2_get_latency(pHPF: *mut ma_hpf2) -> ma_uint32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_hpf_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub order: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_hpf_config() {
    assert_eq!(
        ::core::mem::size_of::<ma_hpf_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_hpf_config))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_hpf_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_hpf_config))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf_config>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf_config>())).channels as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf_config>())).sampleRate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf_config>())).cutoffFrequency as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf_config),
            "::",
            stringify!(cutoffFrequency)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf_config>())).order as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf_config),
            "::",
            stringify!(order)
        )
    );
}
extern "C" {
    pub fn ma_hpf_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        order: ma_uint32,
    ) -> ma_hpf_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_hpf {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub hpf1Count: ma_uint32,
    pub hpf2Count: ma_uint32,
    pub hpf1: [ma_hpf1; 1usize],
    pub hpf2: [ma_hpf2; 4usize],
}
#[test]
fn bindgen_test_layout_ma_hpf() {
    assert_eq!(
        ::core::mem::size_of::<ma_hpf>(),
        1296usize,
        concat!("Size of: ", stringify!(ma_hpf))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_hpf>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_hpf))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf>())).channels as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf>())).sampleRate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf>())).hpf1Count as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf),
            "::",
            stringify!(hpf1Count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf>())).hpf2Count as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf),
            "::",
            stringify!(hpf2Count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf>())).hpf1 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf),
            "::",
            stringify!(hpf1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hpf>())).hpf2 as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hpf),
            "::",
            stringify!(hpf2)
        )
    );
}
impl ::core::fmt::Debug for ma_hpf {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write ! (f , "ma_hpf {{ format: {:?}, channels: {:?}, sampleRate: {:?}, hpf1Count: {:?}, hpf2Count: {:?}, hpf1: {:?}, hpf2: {:?} }}" , self . format , self . channels , self . sampleRate , self . hpf1Count , self . hpf2Count , self . hpf1 , self . hpf2)
    }
}
extern "C" {
    pub fn ma_hpf_init(pConfig: *const ma_hpf_config, pHPF: *mut ma_hpf) -> ma_result;
}
extern "C" {
    pub fn ma_hpf_reinit(pConfig: *const ma_hpf_config, pHPF: *mut ma_hpf) -> ma_result;
}
extern "C" {
    pub fn ma_hpf_process_pcm_frames(
        pHPF: *mut ma_hpf,
        pFramesOut: *mut libc::c_void,
        pFramesIn: *const libc::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf_get_latency(pHPF: *mut ma_hpf) -> ma_uint32;
}
#[doc = "Band-Pass Filtering"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_bpf2_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub q: f64,
}
#[test]
fn bindgen_test_layout_ma_bpf2_config() {
    assert_eq!(
        ::core::mem::size_of::<ma_bpf2_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_bpf2_config))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_bpf2_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_bpf2_config))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_bpf2_config>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf2_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_bpf2_config>())).channels as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf2_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_bpf2_config>())).sampleRate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf2_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_bpf2_config>())).cutoffFrequency as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf2_config),
            "::",
            stringify!(cutoffFrequency)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_bpf2_config>())).q as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf2_config),
            "::",
            stringify!(q)
        )
    );
}
extern "C" {
    pub fn ma_bpf2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        q: f64,
    ) -> ma_bpf2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_bpf2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_bpf2() {
    assert_eq!(
        ::core::mem::size_of::<ma_bpf2>(),
        284usize,
        concat!("Size of: ", stringify!(ma_bpf2))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_bpf2>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_bpf2))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_bpf2>())).bq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf2),
            "::",
            stringify!(bq)
        )
    );
}
impl ::core::fmt::Debug for ma_bpf2 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "ma_bpf2 {{ bq: {:?} }}", self.bq)
    }
}
extern "C" {
    pub fn ma_bpf2_init(pConfig: *const ma_bpf2_config, pBPF: *mut ma_bpf2) -> ma_result;
}
extern "C" {
    pub fn ma_bpf2_reinit(pConfig: *const ma_bpf2_config, pBPF: *mut ma_bpf2) -> ma_result;
}
extern "C" {
    pub fn ma_bpf2_process_pcm_frames(
        pBPF: *mut ma_bpf2,
        pFramesOut: *mut libc::c_void,
        pFramesIn: *const libc::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_bpf2_get_latency(pBPF: *mut ma_bpf2) -> ma_uint32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_bpf_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub order: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_bpf_config() {
    assert_eq!(
        ::core::mem::size_of::<ma_bpf_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_bpf_config))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_bpf_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_bpf_config))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_bpf_config>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_bpf_config>())).channels as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_bpf_config>())).sampleRate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_bpf_config>())).cutoffFrequency as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf_config),
            "::",
            stringify!(cutoffFrequency)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_bpf_config>())).order as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf_config),
            "::",
            stringify!(order)
        )
    );
}
extern "C" {
    pub fn ma_bpf_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        order: ma_uint32,
    ) -> ma_bpf_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_bpf {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub bpf2Count: ma_uint32,
    pub bpf2: [ma_bpf2; 4usize],
}
#[test]
fn bindgen_test_layout_ma_bpf() {
    assert_eq!(
        ::core::mem::size_of::<ma_bpf>(),
        1148usize,
        concat!("Size of: ", stringify!(ma_bpf))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_bpf>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_bpf))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_bpf>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_bpf>())).channels as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_bpf>())).bpf2Count as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf),
            "::",
            stringify!(bpf2Count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_bpf>())).bpf2 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_bpf),
            "::",
            stringify!(bpf2)
        )
    );
}
impl ::core::fmt::Debug for ma_bpf {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "ma_bpf {{ format: {:?}, channels: {:?}, bpf2Count: {:?}, bpf2: {:?} }}",
            self.format, self.channels, self.bpf2Count, self.bpf2
        )
    }
}
extern "C" {
    pub fn ma_bpf_init(pConfig: *const ma_bpf_config, pBPF: *mut ma_bpf) -> ma_result;
}
extern "C" {
    pub fn ma_bpf_reinit(pConfig: *const ma_bpf_config, pBPF: *mut ma_bpf) -> ma_result;
}
extern "C" {
    pub fn ma_bpf_process_pcm_frames(
        pBPF: *mut ma_bpf,
        pFramesOut: *mut libc::c_void,
        pFramesIn: *const libc::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_bpf_get_latency(pBPF: *mut ma_bpf) -> ma_uint32;
}
#[doc = "Notching Filter"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_notch2_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub q: f64,
    pub frequency: f64,
}
#[test]
fn bindgen_test_layout_ma_notch2_config() {
    assert_eq!(
        ::core::mem::size_of::<ma_notch2_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_notch2_config))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_notch2_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_notch2_config))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_notch2_config>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_notch2_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_notch2_config>())).channels as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_notch2_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_notch2_config>())).sampleRate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_notch2_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_notch2_config>())).q as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_notch2_config),
            "::",
            stringify!(q)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_notch2_config>())).frequency as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_notch2_config),
            "::",
            stringify!(frequency)
        )
    );
}
extern "C" {
    pub fn ma_notch2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        q: f64,
        frequency: f64,
    ) -> ma_notch2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_notch2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_notch2() {
    assert_eq!(
        ::core::mem::size_of::<ma_notch2>(),
        284usize,
        concat!("Size of: ", stringify!(ma_notch2))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_notch2>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_notch2))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_notch2>())).bq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_notch2),
            "::",
            stringify!(bq)
        )
    );
}
impl ::core::fmt::Debug for ma_notch2 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "ma_notch2 {{ bq: {:?} }}", self.bq)
    }
}
extern "C" {
    pub fn ma_notch2_init(pConfig: *const ma_notch2_config, pFilter: *mut ma_notch2) -> ma_result;
}
extern "C" {
    pub fn ma_notch2_reinit(pConfig: *const ma_notch2_config, pFilter: *mut ma_notch2)
        -> ma_result;
}
extern "C" {
    pub fn ma_notch2_process_pcm_frames(
        pFilter: *mut ma_notch2,
        pFramesOut: *mut libc::c_void,
        pFramesIn: *const libc::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_notch2_get_latency(pFilter: *mut ma_notch2) -> ma_uint32;
}
#[doc = "Peaking EQ Filter"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_peak2_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub gainDB: f64,
    pub q: f64,
    pub frequency: f64,
}
#[test]
fn bindgen_test_layout_ma_peak2_config() {
    assert_eq!(
        ::core::mem::size_of::<ma_peak2_config>(),
        40usize,
        concat!("Size of: ", stringify!(ma_peak2_config))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_peak2_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_peak2_config))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_peak2_config>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_peak2_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_peak2_config>())).channels as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_peak2_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_peak2_config>())).sampleRate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_peak2_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_peak2_config>())).gainDB as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_peak2_config),
            "::",
            stringify!(gainDB)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_peak2_config>())).q as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_peak2_config),
            "::",
            stringify!(q)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_peak2_config>())).frequency as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_peak2_config),
            "::",
            stringify!(frequency)
        )
    );
}
extern "C" {
    pub fn ma_peak2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        gainDB: f64,
        q: f64,
        frequency: f64,
    ) -> ma_peak2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_peak2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_peak2() {
    assert_eq!(
        ::core::mem::size_of::<ma_peak2>(),
        284usize,
        concat!("Size of: ", stringify!(ma_peak2))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_peak2>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_peak2))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_peak2>())).bq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_peak2),
            "::",
            stringify!(bq)
        )
    );
}
impl ::core::fmt::Debug for ma_peak2 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "ma_peak2 {{ bq: {:?} }}", self.bq)
    }
}
extern "C" {
    pub fn ma_peak2_init(pConfig: *const ma_peak2_config, pFilter: *mut ma_peak2) -> ma_result;
}
extern "C" {
    pub fn ma_peak2_reinit(pConfig: *const ma_peak2_config, pFilter: *mut ma_peak2) -> ma_result;
}
extern "C" {
    pub fn ma_peak2_process_pcm_frames(
        pFilter: *mut ma_peak2,
        pFramesOut: *mut libc::c_void,
        pFramesIn: *const libc::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_peak2_get_latency(pFilter: *mut ma_peak2) -> ma_uint32;
}
#[doc = "Low Shelf Filter"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_loshelf2_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub gainDB: f64,
    pub shelfSlope: f64,
    pub frequency: f64,
}
#[test]
fn bindgen_test_layout_ma_loshelf2_config() {
    assert_eq!(
        ::core::mem::size_of::<ma_loshelf2_config>(),
        40usize,
        concat!("Size of: ", stringify!(ma_loshelf2_config))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_loshelf2_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_loshelf2_config))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_loshelf2_config>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_loshelf2_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_loshelf2_config>())).channels as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_loshelf2_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_loshelf2_config>())).sampleRate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_loshelf2_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_loshelf2_config>())).gainDB as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_loshelf2_config),
            "::",
            stringify!(gainDB)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_loshelf2_config>())).shelfSlope as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_loshelf2_config),
            "::",
            stringify!(shelfSlope)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_loshelf2_config>())).frequency as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_loshelf2_config),
            "::",
            stringify!(frequency)
        )
    );
}
extern "C" {
    pub fn ma_loshelf2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        gainDB: f64,
        shelfSlope: f64,
        frequency: f64,
    ) -> ma_loshelf2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_loshelf2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_loshelf2() {
    assert_eq!(
        ::core::mem::size_of::<ma_loshelf2>(),
        284usize,
        concat!("Size of: ", stringify!(ma_loshelf2))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_loshelf2>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_loshelf2))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_loshelf2>())).bq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_loshelf2),
            "::",
            stringify!(bq)
        )
    );
}
impl ::core::fmt::Debug for ma_loshelf2 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "ma_loshelf2 {{ bq: {:?} }}", self.bq)
    }
}
extern "C" {
    pub fn ma_loshelf2_init(
        pConfig: *const ma_loshelf2_config,
        pFilter: *mut ma_loshelf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_loshelf2_reinit(
        pConfig: *const ma_loshelf2_config,
        pFilter: *mut ma_loshelf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_loshelf2_process_pcm_frames(
        pFilter: *mut ma_loshelf2,
        pFramesOut: *mut libc::c_void,
        pFramesIn: *const libc::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_loshelf2_get_latency(pFilter: *mut ma_loshelf2) -> ma_uint32;
}
#[doc = "High Shelf Filter"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_hishelf2_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub gainDB: f64,
    pub shelfSlope: f64,
    pub frequency: f64,
}
#[test]
fn bindgen_test_layout_ma_hishelf2_config() {
    assert_eq!(
        ::core::mem::size_of::<ma_hishelf2_config>(),
        40usize,
        concat!("Size of: ", stringify!(ma_hishelf2_config))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_hishelf2_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_hishelf2_config))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hishelf2_config>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hishelf2_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hishelf2_config>())).channels as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hishelf2_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hishelf2_config>())).sampleRate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hishelf2_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hishelf2_config>())).gainDB as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hishelf2_config),
            "::",
            stringify!(gainDB)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hishelf2_config>())).shelfSlope as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hishelf2_config),
            "::",
            stringify!(shelfSlope)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hishelf2_config>())).frequency as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hishelf2_config),
            "::",
            stringify!(frequency)
        )
    );
}
extern "C" {
    pub fn ma_hishelf2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        gainDB: f64,
        shelfSlope: f64,
        frequency: f64,
    ) -> ma_hishelf2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_hishelf2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_hishelf2() {
    assert_eq!(
        ::core::mem::size_of::<ma_hishelf2>(),
        284usize,
        concat!("Size of: ", stringify!(ma_hishelf2))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_hishelf2>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_hishelf2))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_hishelf2>())).bq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_hishelf2),
            "::",
            stringify!(bq)
        )
    );
}
impl ::core::fmt::Debug for ma_hishelf2 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "ma_hishelf2 {{ bq: {:?} }}", self.bq)
    }
}
extern "C" {
    pub fn ma_hishelf2_init(
        pConfig: *const ma_hishelf2_config,
        pFilter: *mut ma_hishelf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hishelf2_reinit(
        pConfig: *const ma_hishelf2_config,
        pFilter: *mut ma_hishelf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hishelf2_process_pcm_frames(
        pFilter: *mut ma_hishelf2,
        pFramesOut: *mut libc::c_void,
        pFramesIn: *const libc::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hishelf2_get_latency(pFilter: *mut ma_hishelf2) -> ma_uint32;
}
#[doc = "Resampling"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_linear_resampler_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRateIn: ma_uint32,
    pub sampleRateOut: ma_uint32,
    pub lpfOrder: ma_uint32,
    pub lpfNyquistFactor: f64,
}
#[test]
fn bindgen_test_layout_ma_linear_resampler_config() {
    assert_eq!(
        ::core::mem::size_of::<ma_linear_resampler_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_linear_resampler_config))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_linear_resampler_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_linear_resampler_config))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_linear_resampler_config>())).format as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_linear_resampler_config>())).channels as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_linear_resampler_config>())).sampleRateIn as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler_config),
            "::",
            stringify!(sampleRateIn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_linear_resampler_config>())).sampleRateOut as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler_config),
            "::",
            stringify!(sampleRateOut)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_linear_resampler_config>())).lpfOrder as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler_config),
            "::",
            stringify!(lpfOrder)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_linear_resampler_config>())).lpfNyquistFactor as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler_config),
            "::",
            stringify!(lpfNyquistFactor)
        )
    );
}
extern "C" {
    pub fn ma_linear_resampler_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
    ) -> ma_linear_resampler_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_linear_resampler {
    pub config: ma_linear_resampler_config,
    pub inAdvanceInt: ma_uint32,
    pub inAdvanceFrac: ma_uint32,
    pub inTimeInt: ma_uint32,
    pub inTimeFrac: ma_uint32,
    pub x0: ma_linear_resampler__bindgen_ty_1,
    pub x1: ma_linear_resampler__bindgen_ty_2,
    pub lpf: ma_lpf,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_linear_resampler__bindgen_ty_1 {
    pub f32_: [f32; 32usize],
    pub s16: [ma_int16; 32usize],
    _bindgen_union_align: [u32; 32usize],
}
#[test]
fn bindgen_test_layout_ma_linear_resampler__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ma_linear_resampler__bindgen_ty_1>(),
        128usize,
        concat!("Size of: ", stringify!(ma_linear_resampler__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_linear_resampler__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ma_linear_resampler__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_linear_resampler__bindgen_ty_1>())).f32_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler__bindgen_ty_1),
            "::",
            stringify!(f32_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_linear_resampler__bindgen_ty_1>())).s16 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler__bindgen_ty_1),
            "::",
            stringify!(s16)
        )
    );
}
impl ::core::fmt::Debug for ma_linear_resampler__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "ma_linear_resampler__bindgen_ty_1 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_linear_resampler__bindgen_ty_2 {
    pub f32_: [f32; 32usize],
    pub s16: [ma_int16; 32usize],
    _bindgen_union_align: [u32; 32usize],
}
#[test]
fn bindgen_test_layout_ma_linear_resampler__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<ma_linear_resampler__bindgen_ty_2>(),
        128usize,
        concat!("Size of: ", stringify!(ma_linear_resampler__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_linear_resampler__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ma_linear_resampler__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_linear_resampler__bindgen_ty_2>())).f32_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler__bindgen_ty_2),
            "::",
            stringify!(f32_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_linear_resampler__bindgen_ty_2>())).s16 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler__bindgen_ty_2),
            "::",
            stringify!(s16)
        )
    );
}
impl ::core::fmt::Debug for ma_linear_resampler__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "ma_linear_resampler__bindgen_ty_2 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_ma_linear_resampler() {
    assert_eq!(
        ::core::mem::size_of::<ma_linear_resampler>(),
        1600usize,
        concat!("Size of: ", stringify!(ma_linear_resampler))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_linear_resampler>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_linear_resampler))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_linear_resampler>())).config as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler),
            "::",
            stringify!(config)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_linear_resampler>())).inAdvanceInt as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler),
            "::",
            stringify!(inAdvanceInt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_linear_resampler>())).inAdvanceFrac as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler),
            "::",
            stringify!(inAdvanceFrac)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_linear_resampler>())).inTimeInt as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler),
            "::",
            stringify!(inTimeInt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_linear_resampler>())).inTimeFrac as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler),
            "::",
            stringify!(inTimeFrac)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_linear_resampler>())).x0 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler),
            "::",
            stringify!(x0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_linear_resampler>())).x1 as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler),
            "::",
            stringify!(x1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_linear_resampler>())).lpf as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_linear_resampler),
            "::",
            stringify!(lpf)
        )
    );
}
impl ::core::fmt::Debug for ma_linear_resampler {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write ! (f , "ma_linear_resampler {{ config: {:?}, inAdvanceInt: {:?}, inAdvanceFrac: {:?}, inTimeInt: {:?}, inTimeFrac: {:?}, x0: {:?}, x1: {:?}, lpf: {:?} }}" , self . config , self . inAdvanceInt , self . inAdvanceFrac , self . inTimeInt , self . inTimeFrac , self . x0 , self . x1 , self . lpf)
    }
}
extern "C" {
    pub fn ma_linear_resampler_init(
        pConfig: *const ma_linear_resampler_config,
        pResampler: *mut ma_linear_resampler,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_uninit(pResampler: *mut ma_linear_resampler);
}
extern "C" {
    pub fn ma_linear_resampler_process_pcm_frames(
        pResampler: *mut ma_linear_resampler,
        pFramesIn: *const libc::c_void,
        pFrameCountIn: *mut ma_uint64,
        pFramesOut: *mut libc::c_void,
        pFrameCountOut: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_set_rate(
        pResampler: *mut ma_linear_resampler,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_set_rate_ratio(
        pResampler: *mut ma_linear_resampler,
        ratioInOut: f32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_get_required_input_frame_count(
        pResampler: *mut ma_linear_resampler,
        outputFrameCount: ma_uint64,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_linear_resampler_get_expected_output_frame_count(
        pResampler: *mut ma_linear_resampler,
        inputFrameCount: ma_uint64,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_linear_resampler_get_input_latency(pResampler: *mut ma_linear_resampler)
        -> ma_uint64;
}
extern "C" {
    pub fn ma_linear_resampler_get_output_latency(
        pResampler: *mut ma_linear_resampler,
    ) -> ma_uint64;
}
pub const ma_resample_algorithm_linear: ma_resample_algorithm = 0;
pub const ma_resample_algorithm_speex: ma_resample_algorithm = 1;
pub type ma_resample_algorithm = libc::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_resampler_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRateIn: ma_uint32,
    pub sampleRateOut: ma_uint32,
    pub algorithm: ma_resample_algorithm,
    pub linear: ma_resampler_config__bindgen_ty_1,
    pub speex: ma_resampler_config__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_resampler_config__bindgen_ty_1 {
    pub lpfOrder: ma_uint32,
    pub lpfNyquistFactor: f64,
}
#[test]
fn bindgen_test_layout_ma_resampler_config__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ma_resampler_config__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(ma_resampler_config__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_resampler_config__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ma_resampler_config__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_resampler_config__bindgen_ty_1>())).lpfOrder as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler_config__bindgen_ty_1),
            "::",
            stringify!(lpfOrder)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_resampler_config__bindgen_ty_1>())).lpfNyquistFactor
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler_config__bindgen_ty_1),
            "::",
            stringify!(lpfNyquistFactor)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_resampler_config__bindgen_ty_2 {
    pub quality: libc::c_int,
}
#[test]
fn bindgen_test_layout_ma_resampler_config__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<ma_resampler_config__bindgen_ty_2>(),
        4usize,
        concat!("Size of: ", stringify!(ma_resampler_config__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_resampler_config__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ma_resampler_config__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_resampler_config__bindgen_ty_2>())).quality as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler_config__bindgen_ty_2),
            "::",
            stringify!(quality)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_resampler_config() {
    assert_eq!(
        ::core::mem::size_of::<ma_resampler_config>(),
        48usize,
        concat!("Size of: ", stringify!(ma_resampler_config))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_resampler_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_resampler_config))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_resampler_config>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_resampler_config>())).channels as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler_config),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_resampler_config>())).sampleRateIn as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler_config),
            "::",
            stringify!(sampleRateIn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_resampler_config>())).sampleRateOut as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler_config),
            "::",
            stringify!(sampleRateOut)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_resampler_config>())).algorithm as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler_config),
            "::",
            stringify!(algorithm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_resampler_config>())).linear as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler_config),
            "::",
            stringify!(linear)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_resampler_config>())).speex as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler_config),
            "::",
            stringify!(speex)
        )
    );
}
extern "C" {
    pub fn ma_resampler_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
        algorithm: ma_resample_algorithm,
    ) -> ma_resampler_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_resampler {
    pub config: ma_resampler_config,
    pub state: ma_resampler__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_resampler__bindgen_ty_1 {
    pub linear: ma_linear_resampler,
    pub speex: ma_resampler__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: [u64; 200usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_resampler__bindgen_ty_1__bindgen_ty_1 {
    pub pSpeexResamplerState: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout_ma_resampler__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ma_resampler__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(ma_resampler__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<ma_resampler__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ma_resampler__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_resampler__bindgen_ty_1__bindgen_ty_1>()))
                .pSpeexResamplerState as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(pSpeexResamplerState)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_resampler__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ma_resampler__bindgen_ty_1>(),
        1600usize,
        concat!("Size of: ", stringify!(ma_resampler__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_resampler__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_resampler__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_resampler__bindgen_ty_1>())).linear as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler__bindgen_ty_1),
            "::",
            stringify!(linear)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_resampler__bindgen_ty_1>())).speex as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler__bindgen_ty_1),
            "::",
            stringify!(speex)
        )
    );
}
impl ::core::fmt::Debug for ma_resampler__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "ma_resampler__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_ma_resampler() {
    assert_eq!(
        ::core::mem::size_of::<ma_resampler>(),
        1648usize,
        concat!("Size of: ", stringify!(ma_resampler))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_resampler>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_resampler))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_resampler>())).config as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler),
            "::",
            stringify!(config)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_resampler>())).state as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_resampler),
            "::",
            stringify!(state)
        )
    );
}
impl ::core::fmt::Debug for ma_resampler {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "ma_resampler {{ config: {:?}, state: {:?} }}",
            self.config, self.state
        )
    }
}
extern "C" {
    pub fn ma_resampler_init(
        pConfig: *const ma_resampler_config,
        pResampler: *mut ma_resampler,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_uninit(pResampler: *mut ma_resampler);
}
extern "C" {
    pub fn ma_resampler_process_pcm_frames(
        pResampler: *mut ma_resampler,
        pFramesIn: *const libc::c_void,
        pFrameCountIn: *mut ma_uint64,
        pFramesOut: *mut libc::c_void,
        pFrameCountOut: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_set_rate(
        pResampler: *mut ma_resampler,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_set_rate_ratio(pResampler: *mut ma_resampler, ratio: f32) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_get_required_input_frame_count(
        pResampler: *mut ma_resampler,
        outputFrameCount: ma_uint64,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_resampler_get_expected_output_frame_count(
        pResampler: *mut ma_resampler,
        inputFrameCount: ma_uint64,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_resampler_get_input_latency(pResampler: *mut ma_resampler) -> ma_uint64;
}
extern "C" {
    pub fn ma_resampler_get_output_latency(pResampler: *mut ma_resampler) -> ma_uint64;
}
#[doc = "Channel Conversion"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_channel_converter_config {
    pub format: ma_format,
    pub channelsIn: ma_uint32,
    pub channelsOut: ma_uint32,
    pub channelMapIn: [ma_channel; 32usize],
    pub channelMapOut: [ma_channel; 32usize],
    pub mixingMode: ma_channel_mix_mode,
    pub weights: [[f32; 32usize]; 32usize],
}
#[test]
fn bindgen_test_layout_ma_channel_converter_config() {
    assert_eq!(
        ::core::mem::size_of::<ma_channel_converter_config>(),
        4176usize,
        concat!("Size of: ", stringify!(ma_channel_converter_config))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_channel_converter_config>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_channel_converter_config))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_channel_converter_config>())).format as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter_config),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_channel_converter_config>())).channelsIn as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter_config),
            "::",
            stringify!(channelsIn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_channel_converter_config>())).channelsOut as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter_config),
            "::",
            stringify!(channelsOut)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_channel_converter_config>())).channelMapIn as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter_config),
            "::",
            stringify!(channelMapIn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_channel_converter_config>())).channelMapOut as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter_config),
            "::",
            stringify!(channelMapOut)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_channel_converter_config>())).mixingMode as *const _ as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter_config),
            "::",
            stringify!(mixingMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_channel_converter_config>())).weights as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter_config),
            "::",
            stringify!(weights)
        )
    );
}
extern "C" {
    pub fn ma_channel_converter_config_init(
        format: ma_format,
        channelsIn: ma_uint32,
        pChannelMapIn: *const ma_channel,
        channelsOut: ma_uint32,
        pChannelMapOut: *const ma_channel,
        mixingMode: ma_channel_mix_mode,
    ) -> ma_channel_converter_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_channel_converter {
    pub format: ma_format,
    pub channelsIn: ma_uint32,
    pub channelsOut: ma_uint32,
    pub channelMapIn: [ma_channel; 32usize],
    pub channelMapOut: [ma_channel; 32usize],
    pub mixingMode: ma_channel_mix_mode,
    pub weights: ma_channel_converter__bindgen_ty_1,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    pub __bindgen_padding_0: [u8; 3usize],
    pub shuffleTable: [ma_uint8; 32usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_channel_converter__bindgen_ty_1 {
    pub f32_: [[f32; 32usize]; 32usize],
    pub s16: [[ma_int32; 32usize]; 32usize],
    _bindgen_union_align: [u32; 1024usize],
}
#[test]
fn bindgen_test_layout_ma_channel_converter__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ma_channel_converter__bindgen_ty_1>(),
        4096usize,
        concat!("Size of: ", stringify!(ma_channel_converter__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_channel_converter__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ma_channel_converter__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_channel_converter__bindgen_ty_1>())).f32_ as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter__bindgen_ty_1),
            "::",
            stringify!(f32_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_channel_converter__bindgen_ty_1>())).s16 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter__bindgen_ty_1),
            "::",
            stringify!(s16)
        )
    );
}
impl ::core::fmt::Debug for ma_channel_converter__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "ma_channel_converter__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_ma_channel_converter() {
    assert_eq!(
        ::core::mem::size_of::<ma_channel_converter>(),
        4212usize,
        concat!("Size of: ", stringify!(ma_channel_converter))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_channel_converter>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_channel_converter))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_channel_converter>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_channel_converter>())).channelsIn as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter),
            "::",
            stringify!(channelsIn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_channel_converter>())).channelsOut as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter),
            "::",
            stringify!(channelsOut)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_channel_converter>())).channelMapIn as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter),
            "::",
            stringify!(channelMapIn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_channel_converter>())).channelMapOut as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter),
            "::",
            stringify!(channelMapOut)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_channel_converter>())).mixingMode as *const _ as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter),
            "::",
            stringify!(mixingMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_channel_converter>())).weights as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter),
            "::",
            stringify!(weights)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_channel_converter>())).shuffleTable as *const _ as usize
        },
        4180usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_channel_converter),
            "::",
            stringify!(shuffleTable)
        )
    );
}
impl ::core::fmt::Debug for ma_channel_converter {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write ! (f , "ma_channel_converter {{ format: {:?}, channelsIn: {:?}, channelsOut: {:?}, channelMapIn: [...], channelMapOut: [...], mixingMode: {:?}, weights: {:?}, isPassthrough : {:?}, isSimpleShuffle : {:?}, isSimpleMonoExpansion : {:?}, isStereoToMono : {:?}, shuffleTable: [...] }}" , self . format , self . channelsIn , self . channelsOut , self . mixingMode , self . weights , self . isPassthrough () , self . isSimpleShuffle () , self . isSimpleMonoExpansion () , self . isStereoToMono ())
    }
}
impl ma_channel_converter {
    #[inline]
    pub fn isPassthrough(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_isPassthrough(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn isSimpleShuffle(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_isSimpleShuffle(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn isSimpleMonoExpansion(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_isSimpleMonoExpansion(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn isStereoToMono(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_isStereoToMono(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        isPassthrough: ma_bool32,
        isSimpleShuffle: ma_bool32,
        isSimpleMonoExpansion: ma_bool32,
        isStereoToMono: ma_bool32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let isPassthrough: u32 = unsafe { ::core::mem::transmute(isPassthrough) };
            isPassthrough as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let isSimpleShuffle: u32 = unsafe { ::core::mem::transmute(isSimpleShuffle) };
            isSimpleShuffle as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let isSimpleMonoExpansion: u32 =
                unsafe { ::core::mem::transmute(isSimpleMonoExpansion) };
            isSimpleMonoExpansion as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let isStereoToMono: u32 = unsafe { ::core::mem::transmute(isStereoToMono) };
            isStereoToMono as u64
        });
        __bindgen_bitfield_unit
    }
}
extern "C" {
    pub fn ma_channel_converter_init(
        pConfig: *const ma_channel_converter_config,
        pConverter: *mut ma_channel_converter,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_channel_converter_uninit(pConverter: *mut ma_channel_converter);
}
extern "C" {
    pub fn ma_channel_converter_process_pcm_frames(
        pConverter: *mut ma_channel_converter,
        pFramesOut: *mut libc::c_void,
        pFramesIn: *const libc::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
#[doc = "Data Conversion"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_data_converter_config {
    pub formatIn: ma_format,
    pub formatOut: ma_format,
    pub channelsIn: ma_uint32,
    pub channelsOut: ma_uint32,
    pub sampleRateIn: ma_uint32,
    pub sampleRateOut: ma_uint32,
    pub channelMapIn: [ma_channel; 32usize],
    pub channelMapOut: [ma_channel; 32usize],
    pub ditherMode: ma_dither_mode,
    pub channelMixMode: ma_channel_mix_mode,
    pub channelWeights: [[f32; 32usize]; 32usize],
    pub resampling: ma_data_converter_config__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_data_converter_config__bindgen_ty_1 {
    pub algorithm: ma_resample_algorithm,
    pub allowDynamicSampleRate: ma_bool32,
    pub linear: ma_data_converter_config__bindgen_ty_1__bindgen_ty_1,
    pub speex: ma_data_converter_config__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_data_converter_config__bindgen_ty_1__bindgen_ty_1 {
    pub lpfOrder: ma_uint32,
    pub lpfNyquistFactor: f64,
}
#[test]
fn bindgen_test_layout_ma_data_converter_config__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ma_data_converter_config__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(ma_data_converter_config__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<ma_data_converter_config__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ma_data_converter_config__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_converter_config__bindgen_ty_1__bindgen_ty_1>()))
                .lpfOrder as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(lpfOrder)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_converter_config__bindgen_ty_1__bindgen_ty_1>()))
                .lpfNyquistFactor as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(lpfNyquistFactor)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_data_converter_config__bindgen_ty_1__bindgen_ty_2 {
    pub quality: libc::c_int,
}
#[test]
fn bindgen_test_layout_ma_data_converter_config__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<ma_data_converter_config__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(ma_data_converter_config__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<ma_data_converter_config__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ma_data_converter_config__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_converter_config__bindgen_ty_1__bindgen_ty_2>()))
                .quality as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(quality)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_data_converter_config__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ma_data_converter_config__bindgen_ty_1>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(ma_data_converter_config__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<ma_data_converter_config__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ma_data_converter_config__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_converter_config__bindgen_ty_1>())).algorithm
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config__bindgen_ty_1),
            "::",
            stringify!(algorithm)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_converter_config__bindgen_ty_1>()))
                .allowDynamicSampleRate as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config__bindgen_ty_1),
            "::",
            stringify!(allowDynamicSampleRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_converter_config__bindgen_ty_1>())).linear as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config__bindgen_ty_1),
            "::",
            stringify!(linear)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_converter_config__bindgen_ty_1>())).speex as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config__bindgen_ty_1),
            "::",
            stringify!(speex)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_data_converter_config() {
    assert_eq!(
        ::core::mem::size_of::<ma_data_converter_config>(),
        4224usize,
        concat!("Size of: ", stringify!(ma_data_converter_config))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_data_converter_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_data_converter_config))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_converter_config>())).formatIn as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(formatIn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_converter_config>())).formatOut as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(formatOut)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_converter_config>())).channelsIn as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(channelsIn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_converter_config>())).channelsOut as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(channelsOut)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_converter_config>())).sampleRateIn as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(sampleRateIn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_converter_config>())).sampleRateOut as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(sampleRateOut)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_converter_config>())).channelMapIn as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(channelMapIn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_converter_config>())).channelMapOut as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(channelMapOut)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_converter_config>())).ditherMode as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(ditherMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_converter_config>())).channelMixMode as *const _
                as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(channelMixMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_converter_config>())).channelWeights as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(channelWeights)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_converter_config>())).resampling as *const _ as usize
        },
        4192usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter_config),
            "::",
            stringify!(resampling)
        )
    );
}
extern "C" {
    pub fn ma_data_converter_config_init_default() -> ma_data_converter_config;
}
extern "C" {
    pub fn ma_data_converter_config_init(
        formatIn: ma_format,
        formatOut: ma_format,
        channelsIn: ma_uint32,
        channelsOut: ma_uint32,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
    ) -> ma_data_converter_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_data_converter {
    pub config: ma_data_converter_config,
    pub channelConverter: ma_channel_converter,
    pub resampler: ma_resampler,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    pub __bindgen_padding_0: [u8; 7usize],
}
#[test]
fn bindgen_test_layout_ma_data_converter() {
    assert_eq!(
        ::core::mem::size_of::<ma_data_converter>(),
        10096usize,
        concat!("Size of: ", stringify!(ma_data_converter))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_data_converter>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_data_converter))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_data_converter>())).config as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter),
            "::",
            stringify!(config)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_converter>())).channelConverter as *const _ as usize
        },
        4224usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter),
            "::",
            stringify!(channelConverter)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_data_converter>())).resampler as *const _ as usize },
        8440usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_converter),
            "::",
            stringify!(resampler)
        )
    );
}
impl ::core::fmt::Debug for ma_data_converter {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write ! (f , "ma_data_converter {{ config: {:?}, channelConverter: {:?}, resampler: {:?}, hasPreFormatConversion : {:?}, hasPostFormatConversion : {:?}, hasChannelConverter : {:?}, hasResampler : {:?}, isPassthrough : {:?} }}" , self . config , self . channelConverter , self . resampler , self . hasPreFormatConversion () , self . hasPostFormatConversion () , self . hasChannelConverter () , self . hasResampler () , self . isPassthrough ())
    }
}
impl ma_data_converter {
    #[inline]
    pub fn hasPreFormatConversion(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hasPreFormatConversion(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hasPostFormatConversion(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hasPostFormatConversion(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hasChannelConverter(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hasChannelConverter(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hasResampler(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hasResampler(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn isPassthrough(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_isPassthrough(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        hasPreFormatConversion: ma_bool32,
        hasPostFormatConversion: ma_bool32,
        hasChannelConverter: ma_bool32,
        hasResampler: ma_bool32,
        isPassthrough: ma_bool32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let hasPreFormatConversion: u32 =
                unsafe { ::core::mem::transmute(hasPreFormatConversion) };
            hasPreFormatConversion as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let hasPostFormatConversion: u32 =
                unsafe { ::core::mem::transmute(hasPostFormatConversion) };
            hasPostFormatConversion as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let hasChannelConverter: u32 = unsafe { ::core::mem::transmute(hasChannelConverter) };
            hasChannelConverter as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let hasResampler: u32 = unsafe { ::core::mem::transmute(hasResampler) };
            hasResampler as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let isPassthrough: u32 = unsafe { ::core::mem::transmute(isPassthrough) };
            isPassthrough as u64
        });
        __bindgen_bitfield_unit
    }
}
extern "C" {
    pub fn ma_data_converter_init(
        pConfig: *const ma_data_converter_config,
        pConverter: *mut ma_data_converter,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_uninit(pConverter: *mut ma_data_converter);
}
extern "C" {
    pub fn ma_data_converter_process_pcm_frames(
        pConverter: *mut ma_data_converter,
        pFramesIn: *const libc::c_void,
        pFrameCountIn: *mut ma_uint64,
        pFramesOut: *mut libc::c_void,
        pFrameCountOut: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_set_rate(
        pConverter: *mut ma_data_converter,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_set_rate_ratio(
        pConverter: *mut ma_data_converter,
        ratioInOut: f32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_get_required_input_frame_count(
        pConverter: *mut ma_data_converter,
        outputFrameCount: ma_uint64,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_data_converter_get_expected_output_frame_count(
        pConverter: *mut ma_data_converter,
        inputFrameCount: ma_uint64,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_data_converter_get_input_latency(pConverter: *mut ma_data_converter) -> ma_uint64;
}
extern "C" {
    pub fn ma_data_converter_get_output_latency(pConverter: *mut ma_data_converter) -> ma_uint64;
}
extern "C" {
    #[doc = "Format Conversion"]
    pub fn ma_pcm_u8_to_s16(
        pOut: *mut libc::c_void,
        pIn: *const libc::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_u8_to_s24(
        pOut: *mut libc::c_void,
        pIn: *const libc::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_u8_to_s32(
        pOut: *mut libc::c_void,
        pIn: *const libc::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_u8_to_f32(
        pOut: *mut libc::c_void,
        pIn: *const libc::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s16_to_u8(
        pOut: *mut libc::c_void,
        pIn: *const libc::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s16_to_s24(
        pOut: *mut libc::c_void,
        pIn: *const libc::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s16_to_s32(
        pOut: *mut libc::c_void,
        pIn: *const libc::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s16_to_f32(
        pOut: *mut libc::c_void,
        pIn: *const libc::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s24_to_u8(
        pOut: *mut libc::c_void,
        pIn: *const libc::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s24_to_s16(
        pOut: *mut libc::c_void,
        pIn: *const libc::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s24_to_s32(
        pOut: *mut libc::c_void,
        pIn: *const libc::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s24_to_f32(
        pOut: *mut libc::c_void,
        pIn: *const libc::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s32_to_u8(
        pOut: *mut libc::c_void,
        pIn: *const libc::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s32_to_s16(
        pOut: *mut libc::c_void,
        pIn: *const libc::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s32_to_s24(
        pOut: *mut libc::c_void,
        pIn: *const libc::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s32_to_f32(
        pOut: *mut libc::c_void,
        pIn: *const libc::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_f32_to_u8(
        pOut: *mut libc::c_void,
        pIn: *const libc::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_f32_to_s16(
        pOut: *mut libc::c_void,
        pIn: *const libc::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_f32_to_s24(
        pOut: *mut libc::c_void,
        pIn: *const libc::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_f32_to_s32(
        pOut: *mut libc::c_void,
        pIn: *const libc::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_convert(
        pOut: *mut libc::c_void,
        formatOut: ma_format,
        pIn: *const libc::c_void,
        formatIn: ma_format,
        sampleCount: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_convert_pcm_frames_format(
        pOut: *mut libc::c_void,
        formatOut: ma_format,
        pIn: *const libc::c_void,
        formatIn: ma_format,
        frameCount: ma_uint64,
        channels: ma_uint32,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_deinterleave_pcm_frames(
        format: ma_format,
        channels: ma_uint32,
        frameCount: ma_uint64,
        pInterleavedPCMFrames: *const libc::c_void,
        ppDeinterleavedPCMFrames: *mut *mut libc::c_void,
    );
}
extern "C" {
    pub fn ma_interleave_pcm_frames(
        format: ma_format,
        channels: ma_uint32,
        frameCount: ma_uint64,
        ppDeinterleavedPCMFrames: *mut *const libc::c_void,
        pInterleavedPCMFrames: *mut libc::c_void,
    );
}
extern "C" {
    #[doc = "Channel Maps"]
    pub fn ma_get_standard_channel_map(
        standardChannelMap: ma_standard_channel_map,
        channels: ma_uint32,
        pChannelMap: *mut ma_channel,
    );
}
extern "C" {
    pub fn ma_channel_map_copy(pOut: *mut ma_channel, pIn: *const ma_channel, channels: ma_uint32);
}
extern "C" {
    pub fn ma_channel_map_copy_or_default(
        pOut: *mut ma_channel,
        pIn: *const ma_channel,
        channels: ma_uint32,
    );
}
extern "C" {
    pub fn ma_channel_map_valid(channels: ma_uint32, pChannelMap: *const ma_channel) -> ma_bool32;
}
extern "C" {
    pub fn ma_channel_map_equal(
        channels: ma_uint32,
        pChannelMapA: *const ma_channel,
        pChannelMapB: *const ma_channel,
    ) -> ma_bool32;
}
extern "C" {
    pub fn ma_channel_map_blank(channels: ma_uint32, pChannelMap: *const ma_channel) -> ma_bool32;
}
extern "C" {
    pub fn ma_channel_map_contains_channel_position(
        channels: ma_uint32,
        pChannelMap: *const ma_channel,
        channelPosition: ma_channel,
    ) -> ma_bool32;
}
extern "C" {
    #[doc = "Conversion Helpers"]
    pub fn ma_convert_frames(
        pOut: *mut libc::c_void,
        frameCountOut: ma_uint64,
        formatOut: ma_format,
        channelsOut: ma_uint32,
        sampleRateOut: ma_uint32,
        pIn: *const libc::c_void,
        frameCountIn: ma_uint64,
        formatIn: ma_format,
        channelsIn: ma_uint32,
        sampleRateIn: ma_uint32,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_convert_frames_ex(
        pOut: *mut libc::c_void,
        frameCountOut: ma_uint64,
        pIn: *const libc::c_void,
        frameCountIn: ma_uint64,
        pConfig: *const ma_data_converter_config,
    ) -> ma_uint64;
}
#[doc = "Ring Buffer"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_rb {
    pub pBuffer: *mut libc::c_void,
    pub subbufferSizeInBytes: ma_uint32,
    pub subbufferCount: ma_uint32,
    pub subbufferStrideInBytes: ma_uint32,
    pub encodedReadOffset: ma_uint32,
    pub encodedWriteOffset: ma_uint32,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    pub allocationCallbacks: ma_allocation_callbacks,
}
#[test]
fn bindgen_test_layout_ma_rb() {
    assert_eq!(
        ::core::mem::size_of::<ma_rb>(),
        64usize,
        concat!("Size of: ", stringify!(ma_rb))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_rb>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_rb))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_rb>())).pBuffer as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_rb),
            "::",
            stringify!(pBuffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_rb>())).subbufferSizeInBytes as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_rb),
            "::",
            stringify!(subbufferSizeInBytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_rb>())).subbufferCount as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_rb),
            "::",
            stringify!(subbufferCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_rb>())).subbufferStrideInBytes as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_rb),
            "::",
            stringify!(subbufferStrideInBytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_rb>())).encodedReadOffset as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_rb),
            "::",
            stringify!(encodedReadOffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_rb>())).encodedWriteOffset as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_rb),
            "::",
            stringify!(encodedWriteOffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_rb>())).allocationCallbacks as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_rb),
            "::",
            stringify!(allocationCallbacks)
        )
    );
}
impl ma_rb {
    #[inline]
    pub fn ownsBuffer(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ownsBuffer(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn clearOnWriteAcquire(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_clearOnWriteAcquire(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ownsBuffer: ma_bool32,
        clearOnWriteAcquire: ma_bool32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let ownsBuffer: u32 = unsafe { ::core::mem::transmute(ownsBuffer) };
            ownsBuffer as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let clearOnWriteAcquire: u32 = unsafe { ::core::mem::transmute(clearOnWriteAcquire) };
            clearOnWriteAcquire as u64
        });
        __bindgen_bitfield_unit
    }
}
extern "C" {
    pub fn ma_rb_init_ex(
        subbufferSizeInBytes: usize,
        subbufferCount: usize,
        subbufferStrideInBytes: usize,
        pOptionalPreallocatedBuffer: *mut libc::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pRB: *mut ma_rb,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_rb_init(
        bufferSizeInBytes: usize,
        pOptionalPreallocatedBuffer: *mut libc::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pRB: *mut ma_rb,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_rb_uninit(pRB: *mut ma_rb);
}
extern "C" {
    pub fn ma_rb_reset(pRB: *mut ma_rb);
}
extern "C" {
    pub fn ma_rb_acquire_read(
        pRB: *mut ma_rb,
        pSizeInBytes: *mut usize,
        ppBufferOut: *mut *mut libc::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_rb_commit_read(
        pRB: *mut ma_rb,
        sizeInBytes: usize,
        pBufferOut: *mut libc::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_rb_acquire_write(
        pRB: *mut ma_rb,
        pSizeInBytes: *mut usize,
        ppBufferOut: *mut *mut libc::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_rb_commit_write(
        pRB: *mut ma_rb,
        sizeInBytes: usize,
        pBufferOut: *mut libc::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_rb_seek_read(pRB: *mut ma_rb, offsetInBytes: usize) -> ma_result;
}
extern "C" {
    pub fn ma_rb_seek_write(pRB: *mut ma_rb, offsetInBytes: usize) -> ma_result;
}
extern "C" {
    pub fn ma_rb_pointer_distance(pRB: *mut ma_rb) -> ma_int32;
}
extern "C" {
    pub fn ma_rb_available_read(pRB: *mut ma_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_rb_available_write(pRB: *mut ma_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_rb_get_subbuffer_size(pRB: *mut ma_rb) -> usize;
}
extern "C" {
    pub fn ma_rb_get_subbuffer_stride(pRB: *mut ma_rb) -> usize;
}
extern "C" {
    pub fn ma_rb_get_subbuffer_offset(pRB: *mut ma_rb, subbufferIndex: usize) -> usize;
}
extern "C" {
    pub fn ma_rb_get_subbuffer_ptr(
        pRB: *mut ma_rb,
        subbufferIndex: usize,
        pBuffer: *mut libc::c_void,
    ) -> *mut libc::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_pcm_rb {
    pub rb: ma_rb,
    pub format: ma_format,
    pub channels: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_pcm_rb() {
    assert_eq!(
        ::core::mem::size_of::<ma_pcm_rb>(),
        72usize,
        concat!("Size of: ", stringify!(ma_pcm_rb))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_pcm_rb>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_pcm_rb))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_pcm_rb>())).rb as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_pcm_rb),
            "::",
            stringify!(rb)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_pcm_rb>())).format as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_pcm_rb),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_pcm_rb>())).channels as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_pcm_rb),
            "::",
            stringify!(channels)
        )
    );
}
extern "C" {
    pub fn ma_pcm_rb_init_ex(
        format: ma_format,
        channels: ma_uint32,
        subbufferSizeInFrames: ma_uint32,
        subbufferCount: ma_uint32,
        subbufferStrideInFrames: ma_uint32,
        pOptionalPreallocatedBuffer: *mut libc::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pRB: *mut ma_pcm_rb,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_init(
        format: ma_format,
        channels: ma_uint32,
        bufferSizeInFrames: ma_uint32,
        pOptionalPreallocatedBuffer: *mut libc::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pRB: *mut ma_pcm_rb,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_uninit(pRB: *mut ma_pcm_rb);
}
extern "C" {
    pub fn ma_pcm_rb_reset(pRB: *mut ma_pcm_rb);
}
extern "C" {
    pub fn ma_pcm_rb_acquire_read(
        pRB: *mut ma_pcm_rb,
        pSizeInFrames: *mut ma_uint32,
        ppBufferOut: *mut *mut libc::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_commit_read(
        pRB: *mut ma_pcm_rb,
        sizeInFrames: ma_uint32,
        pBufferOut: *mut libc::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_acquire_write(
        pRB: *mut ma_pcm_rb,
        pSizeInFrames: *mut ma_uint32,
        ppBufferOut: *mut *mut libc::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_commit_write(
        pRB: *mut ma_pcm_rb,
        sizeInFrames: ma_uint32,
        pBufferOut: *mut libc::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_seek_read(pRB: *mut ma_pcm_rb, offsetInFrames: ma_uint32) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_seek_write(pRB: *mut ma_pcm_rb, offsetInFrames: ma_uint32) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_pointer_distance(pRB: *mut ma_pcm_rb) -> ma_int32;
}
extern "C" {
    pub fn ma_pcm_rb_available_read(pRB: *mut ma_pcm_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_available_write(pRB: *mut ma_pcm_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_get_subbuffer_size(pRB: *mut ma_pcm_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_get_subbuffer_stride(pRB: *mut ma_pcm_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_get_subbuffer_offset(
        pRB: *mut ma_pcm_rb,
        subbufferIndex: ma_uint32,
    ) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_get_subbuffer_ptr(
        pRB: *mut ma_pcm_rb,
        subbufferIndex: ma_uint32,
        pBuffer: *mut libc::c_void,
    ) -> *mut libc::c_void;
}
extern "C" {
    #[doc = "Miscellaneous Helpers"]
    pub fn ma_result_description(result: ma_result) -> *const libc::c_char;
}
extern "C" {
    pub fn ma_malloc(
        sz: usize,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn ma_realloc(
        p: *mut libc::c_void,
        sz: usize,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn ma_free(p: *mut libc::c_void, pAllocationCallbacks: *const ma_allocation_callbacks);
}
extern "C" {
    pub fn ma_aligned_malloc(
        sz: usize,
        alignment: usize,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn ma_aligned_free(
        p: *mut libc::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_get_format_name(format: ma_format) -> *const libc::c_char;
}
extern "C" {
    pub fn ma_blend_f32(
        pOut: *mut f32,
        pInA: *mut f32,
        pInB: *mut f32,
        factor: f32,
        channels: ma_uint32,
    );
}
extern "C" {
    pub fn ma_get_bytes_per_sample(format: ma_format) -> ma_uint32;
}
extern "C" {
    pub fn ma_log_level_to_string(logLevel: ma_uint32) -> *const libc::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_IMMNotificationClient {
    pub lpVtbl: *mut libc::c_void,
    pub counter: ma_uint32,
    pub pDevice: *mut ma_device,
}
#[test]
fn bindgen_test_layout_ma_IMMNotificationClient() {
    assert_eq!(
        ::core::mem::size_of::<ma_IMMNotificationClient>(),
        24usize,
        concat!("Size of: ", stringify!(ma_IMMNotificationClient))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_IMMNotificationClient>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_IMMNotificationClient))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_IMMNotificationClient>())).lpVtbl as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_IMMNotificationClient),
            "::",
            stringify!(lpVtbl)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_IMMNotificationClient>())).counter as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_IMMNotificationClient),
            "::",
            stringify!(counter)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_IMMNotificationClient>())).pDevice as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_IMMNotificationClient),
            "::",
            stringify!(pDevice)
        )
    );
}
pub const ma_backend_wasapi: ma_backend = 0;
pub const ma_backend_dsound: ma_backend = 1;
pub const ma_backend_winmm: ma_backend = 2;
pub const ma_backend_coreaudio: ma_backend = 3;
pub const ma_backend_sndio: ma_backend = 4;
pub const ma_backend_audio4: ma_backend = 5;
pub const ma_backend_oss: ma_backend = 6;
pub const ma_backend_pulseaudio: ma_backend = 7;
pub const ma_backend_alsa: ma_backend = 8;
pub const ma_backend_jack: ma_backend = 9;
pub const ma_backend_aaudio: ma_backend = 10;
pub const ma_backend_opensl: ma_backend = 11;
pub const ma_backend_webaudio: ma_backend = 12;
pub const ma_backend_null: ma_backend = 13;
pub type ma_backend = libc::c_int;
pub type ma_device_callback_proc = ::core::option::Option<
    unsafe extern "C" fn(
        pDevice: *mut ma_device,
        pOutput: *mut libc::c_void,
        pInput: *const libc::c_void,
        frameCount: ma_uint32,
    ),
>;
pub type ma_stop_proc = ::core::option::Option<unsafe extern "C" fn(pDevice: *mut ma_device)>;
pub type ma_log_proc = ::core::option::Option<
    unsafe extern "C" fn(
        pContext: *mut ma_context,
        pDevice: *mut ma_device,
        logLevel: ma_uint32,
        message: *const libc::c_char,
    ),
>;
pub const ma_device_type_playback: ma_device_type = 1;
pub const ma_device_type_capture: ma_device_type = 2;
pub const ma_device_type_duplex: ma_device_type = 3;
pub const ma_device_type_loopback: ma_device_type = 4;
pub type ma_device_type = libc::c_int;
pub const ma_share_mode_shared: ma_share_mode = 0;
pub const ma_share_mode_exclusive: ma_share_mode = 1;
pub type ma_share_mode = libc::c_int;
pub const ma_ios_session_category_default: ma_ios_session_category = 0;
pub const ma_ios_session_category_none: ma_ios_session_category = 1;
pub const ma_ios_session_category_ambient: ma_ios_session_category = 2;
pub const ma_ios_session_category_solo_ambient: ma_ios_session_category = 3;
pub const ma_ios_session_category_playback: ma_ios_session_category = 4;
pub const ma_ios_session_category_record: ma_ios_session_category = 5;
pub const ma_ios_session_category_play_and_record: ma_ios_session_category = 6;
pub const ma_ios_session_category_multi_route: ma_ios_session_category = 7;
pub type ma_ios_session_category = libc::c_int;
pub const ma_ios_session_category_option_mix_with_others: ma_ios_session_category_option = 1;
pub const ma_ios_session_category_option_duck_others: ma_ios_session_category_option = 2;
pub const ma_ios_session_category_option_allow_bluetooth: ma_ios_session_category_option = 4;
pub const ma_ios_session_category_option_default_to_speaker: ma_ios_session_category_option = 8;
pub const ma_ios_session_category_option_interrupt_spoken_audio_and_mix_with_others:
    ma_ios_session_category_option = 17;
pub const ma_ios_session_category_option_allow_bluetooth_a2dp: ma_ios_session_category_option = 32;
pub const ma_ios_session_category_option_allow_air_play: ma_ios_session_category_option = 64;
pub type ma_ios_session_category_option = libc::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_timer {
    pub counter: ma_int64,
    pub counterD: f64,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_ma_timer() {
    assert_eq!(
        ::core::mem::size_of::<ma_timer>(),
        8usize,
        concat!("Size of: ", stringify!(ma_timer))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_timer>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_timer))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_timer>())).counter as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_timer),
            "::",
            stringify!(counter)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_timer>())).counterD as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_timer),
            "::",
            stringify!(counterD)
        )
    );
}
impl ::core::fmt::Debug for ma_timer {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "ma_timer {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_device_id {
    pub wasapi: [wchar_t; 64usize],
    pub dsound: [ma_uint8; 16usize],
    pub winmm: ma_uint32,
    pub alsa: [libc::c_char; 256usize],
    pub pulse: [libc::c_char; 256usize],
    pub jack: libc::c_int,
    pub coreaudio: [libc::c_char; 256usize],
    pub sndio: [libc::c_char; 256usize],
    pub audio4: [libc::c_char; 256usize],
    pub oss: [libc::c_char; 64usize],
    pub aaudio: ma_int32,
    pub opensl: ma_uint32,
    pub webaudio: [libc::c_char; 32usize],
    pub nullbackend: libc::c_int,
    _bindgen_union_align: [u32; 64usize],
}
#[test]
fn bindgen_test_layout_ma_device_id() {
    assert_eq!(
        ::core::mem::size_of::<ma_device_id>(),
        256usize,
        concat!("Size of: ", stringify!(ma_device_id))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device_id>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_device_id))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_id>())).wasapi as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_id),
            "::",
            stringify!(wasapi)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_id>())).dsound as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_id),
            "::",
            stringify!(dsound)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_id>())).winmm as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_id),
            "::",
            stringify!(winmm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_id>())).alsa as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_id),
            "::",
            stringify!(alsa)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_id>())).pulse as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_id),
            "::",
            stringify!(pulse)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_id>())).jack as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_id),
            "::",
            stringify!(jack)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_id>())).coreaudio as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_id),
            "::",
            stringify!(coreaudio)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_id>())).sndio as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_id),
            "::",
            stringify!(sndio)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_id>())).audio4 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_id),
            "::",
            stringify!(audio4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_id>())).oss as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_id),
            "::",
            stringify!(oss)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_id>())).aaudio as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_id),
            "::",
            stringify!(aaudio)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_id>())).opensl as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_id),
            "::",
            stringify!(opensl)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_id>())).webaudio as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_id),
            "::",
            stringify!(webaudio)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_id>())).nullbackend as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_id),
            "::",
            stringify!(nullbackend)
        )
    );
}
impl ::core::fmt::Debug for ma_device_id {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "ma_device_id {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_device_info {
    pub id: ma_device_id,
    pub name: [libc::c_char; 256usize],
    pub formatCount: ma_uint32,
    pub formats: [ma_format; 6usize],
    pub minChannels: ma_uint32,
    pub maxChannels: ma_uint32,
    pub minSampleRate: ma_uint32,
    pub maxSampleRate: ma_uint32,
    pub _private: ma_device_info__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_info__bindgen_ty_1 {
    pub isDefault: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_device_info__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ma_device_info__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(ma_device_info__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device_info__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_device_info__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_info__bindgen_ty_1>())).isDefault as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_info__bindgen_ty_1),
            "::",
            stringify!(isDefault)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_device_info() {
    assert_eq!(
        ::core::mem::size_of::<ma_device_info>(),
        560usize,
        concat!("Size of: ", stringify!(ma_device_info))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device_info>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_device_info))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_info>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_info),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_info>())).name as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_info),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_info>())).formatCount as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_info),
            "::",
            stringify!(formatCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_info>())).formats as *const _ as usize },
        516usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_info),
            "::",
            stringify!(formats)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_info>())).minChannels as *const _ as usize },
        540usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_info),
            "::",
            stringify!(minChannels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_info>())).maxChannels as *const _ as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_info),
            "::",
            stringify!(maxChannels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_info>())).minSampleRate as *const _ as usize },
        548usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_info),
            "::",
            stringify!(minSampleRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_info>())).maxSampleRate as *const _ as usize },
        552usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_info),
            "::",
            stringify!(maxSampleRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_info>()))._private as *const _ as usize },
        556usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_info),
            "::",
            stringify!(_private)
        )
    );
}
impl ::core::fmt::Debug for ma_device_info {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write ! (f , "ma_device_info {{ id: {:?}, name: [...], formatCount: {:?}, formats: {:?}, minChannels: {:?}, maxChannels: {:?}, minSampleRate: {:?}, maxSampleRate: {:?}, _private: {:?} }}" , self . id , self . formatCount , self . formats , self . minChannels , self . maxChannels , self . minSampleRate , self . maxSampleRate , self . _private)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config {
    pub deviceType: ma_device_type,
    pub sampleRate: ma_uint32,
    pub periodSizeInFrames: ma_uint32,
    pub periodSizeInMilliseconds: ma_uint32,
    pub periods: ma_uint32,
    pub performanceProfile: ma_performance_profile,
    pub noPreZeroedOutputBuffer: ma_bool32,
    pub noClip: ma_bool32,
    pub dataCallback: ma_device_callback_proc,
    pub stopCallback: ma_stop_proc,
    pub pUserData: *mut libc::c_void,
    pub resampling: ma_device_config__bindgen_ty_1,
    pub playback: ma_device_config__bindgen_ty_2,
    pub capture: ma_device_config__bindgen_ty_3,
    pub wasapi: ma_device_config__bindgen_ty_4,
    pub alsa: ma_device_config__bindgen_ty_5,
    pub pulse: ma_device_config__bindgen_ty_6,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config__bindgen_ty_1 {
    pub algorithm: ma_resample_algorithm,
    pub linear: ma_device_config__bindgen_ty_1__bindgen_ty_1,
    pub speex: ma_device_config__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config__bindgen_ty_1__bindgen_ty_1 {
    pub lpfOrder: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_device_config__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ma_device_config__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(ma_device_config__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device_config__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ma_device_config__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_1__bindgen_ty_1>())).lpfOrder
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(lpfOrder)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config__bindgen_ty_1__bindgen_ty_2 {
    pub quality: libc::c_int,
}
#[test]
fn bindgen_test_layout_ma_device_config__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<ma_device_config__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(ma_device_config__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device_config__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ma_device_config__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_1__bindgen_ty_2>())).quality
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(quality)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_device_config__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ma_device_config__bindgen_ty_1>(),
        12usize,
        concat!("Size of: ", stringify!(ma_device_config__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device_config__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_device_config__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_1>())).algorithm as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_1),
            "::",
            stringify!(algorithm)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_1>())).linear as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_1),
            "::",
            stringify!(linear)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_1>())).speex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_1),
            "::",
            stringify!(speex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config__bindgen_ty_2 {
    pub pDeviceID: *const ma_device_id,
    pub format: ma_format,
    pub channels: ma_uint32,
    pub channelMap: [ma_channel; 32usize],
    pub shareMode: ma_share_mode,
}
#[test]
fn bindgen_test_layout_ma_device_config__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<ma_device_config__bindgen_ty_2>(),
        56usize,
        concat!("Size of: ", stringify!(ma_device_config__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device_config__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_device_config__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_2>())).pDeviceID as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_2),
            "::",
            stringify!(pDeviceID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_2>())).format as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_2),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_2>())).channels as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_2),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_2>())).channelMap as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_2),
            "::",
            stringify!(channelMap)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_2>())).shareMode as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_2),
            "::",
            stringify!(shareMode)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config__bindgen_ty_3 {
    pub pDeviceID: *const ma_device_id,
    pub format: ma_format,
    pub channels: ma_uint32,
    pub channelMap: [ma_channel; 32usize],
    pub shareMode: ma_share_mode,
}
#[test]
fn bindgen_test_layout_ma_device_config__bindgen_ty_3() {
    assert_eq!(
        ::core::mem::size_of::<ma_device_config__bindgen_ty_3>(),
        56usize,
        concat!("Size of: ", stringify!(ma_device_config__bindgen_ty_3))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device_config__bindgen_ty_3>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_device_config__bindgen_ty_3))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_3>())).pDeviceID as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_3),
            "::",
            stringify!(pDeviceID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_3>())).format as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_3),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_3>())).channels as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_3),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_3>())).channelMap as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_3),
            "::",
            stringify!(channelMap)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_3>())).shareMode as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_3),
            "::",
            stringify!(shareMode)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config__bindgen_ty_4 {
    pub noAutoConvertSRC: ma_bool32,
    pub noDefaultQualitySRC: ma_bool32,
    pub noAutoStreamRouting: ma_bool32,
    pub noHardwareOffloading: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_device_config__bindgen_ty_4() {
    assert_eq!(
        ::core::mem::size_of::<ma_device_config__bindgen_ty_4>(),
        16usize,
        concat!("Size of: ", stringify!(ma_device_config__bindgen_ty_4))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device_config__bindgen_ty_4>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_device_config__bindgen_ty_4))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_4>())).noAutoConvertSRC as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_4),
            "::",
            stringify!(noAutoConvertSRC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_4>())).noDefaultQualitySRC
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_4),
            "::",
            stringify!(noDefaultQualitySRC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_4>())).noAutoStreamRouting
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_4),
            "::",
            stringify!(noAutoStreamRouting)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_4>())).noHardwareOffloading
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_4),
            "::",
            stringify!(noHardwareOffloading)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config__bindgen_ty_5 {
    pub noMMap: ma_bool32,
    pub noAutoFormat: ma_bool32,
    pub noAutoChannels: ma_bool32,
    pub noAutoResample: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_device_config__bindgen_ty_5() {
    assert_eq!(
        ::core::mem::size_of::<ma_device_config__bindgen_ty_5>(),
        16usize,
        concat!("Size of: ", stringify!(ma_device_config__bindgen_ty_5))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device_config__bindgen_ty_5>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_device_config__bindgen_ty_5))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_5>())).noMMap as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_5),
            "::",
            stringify!(noMMap)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_5>())).noAutoFormat as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_5),
            "::",
            stringify!(noAutoFormat)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_5>())).noAutoChannels as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_5),
            "::",
            stringify!(noAutoChannels)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_5>())).noAutoResample as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_5),
            "::",
            stringify!(noAutoResample)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config__bindgen_ty_6 {
    pub pStreamNamePlayback: *const libc::c_char,
    pub pStreamNameCapture: *const libc::c_char,
}
#[test]
fn bindgen_test_layout_ma_device_config__bindgen_ty_6() {
    assert_eq!(
        ::core::mem::size_of::<ma_device_config__bindgen_ty_6>(),
        16usize,
        concat!("Size of: ", stringify!(ma_device_config__bindgen_ty_6))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device_config__bindgen_ty_6>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_device_config__bindgen_ty_6))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_6>())).pStreamNamePlayback
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_6),
            "::",
            stringify!(pStreamNamePlayback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config__bindgen_ty_6>())).pStreamNameCapture
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config__bindgen_ty_6),
            "::",
            stringify!(pStreamNameCapture)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_device_config() {
    assert_eq!(
        ::core::mem::size_of::<ma_device_config>(),
        232usize,
        concat!("Size of: ", stringify!(ma_device_config))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_device_config))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_config>())).deviceType as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config),
            "::",
            stringify!(deviceType)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_config>())).sampleRate as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config>())).periodSizeInFrames as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config),
            "::",
            stringify!(periodSizeInFrames)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config>())).periodSizeInMilliseconds as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config),
            "::",
            stringify!(periodSizeInMilliseconds)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_config>())).periods as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config),
            "::",
            stringify!(periods)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config>())).performanceProfile as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config),
            "::",
            stringify!(performanceProfile)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device_config>())).noPreZeroedOutputBuffer as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config),
            "::",
            stringify!(noPreZeroedOutputBuffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_config>())).noClip as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config),
            "::",
            stringify!(noClip)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_config>())).dataCallback as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config),
            "::",
            stringify!(dataCallback)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_config>())).stopCallback as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config),
            "::",
            stringify!(stopCallback)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_config>())).pUserData as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config),
            "::",
            stringify!(pUserData)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_config>())).resampling as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config),
            "::",
            stringify!(resampling)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_config>())).playback as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config),
            "::",
            stringify!(playback)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_config>())).capture as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config),
            "::",
            stringify!(capture)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_config>())).wasapi as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config),
            "::",
            stringify!(wasapi)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_config>())).alsa as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config),
            "::",
            stringify!(alsa)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device_config>())).pulse as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device_config),
            "::",
            stringify!(pulse)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_context_config {
    pub logCallback: ma_log_proc,
    pub threadPriority: ma_thread_priority,
    pub threadStackSize: usize,
    pub pUserData: *mut libc::c_void,
    pub allocationCallbacks: ma_allocation_callbacks,
    pub alsa: ma_context_config__bindgen_ty_1,
    pub pulse: ma_context_config__bindgen_ty_2,
    pub coreaudio: ma_context_config__bindgen_ty_3,
    pub jack: ma_context_config__bindgen_ty_4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_context_config__bindgen_ty_1 {
    pub useVerboseDeviceEnumeration: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_context_config__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ma_context_config__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(ma_context_config__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_context_config__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_context_config__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context_config__bindgen_ty_1>())).useVerboseDeviceEnumeration
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context_config__bindgen_ty_1),
            "::",
            stringify!(useVerboseDeviceEnumeration)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_context_config__bindgen_ty_2 {
    pub pApplicationName: *const libc::c_char,
    pub pServerName: *const libc::c_char,
    pub tryAutoSpawn: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_context_config__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<ma_context_config__bindgen_ty_2>(),
        24usize,
        concat!("Size of: ", stringify!(ma_context_config__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_context_config__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_context_config__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context_config__bindgen_ty_2>())).pApplicationName
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context_config__bindgen_ty_2),
            "::",
            stringify!(pApplicationName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context_config__bindgen_ty_2>())).pServerName as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context_config__bindgen_ty_2),
            "::",
            stringify!(pServerName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context_config__bindgen_ty_2>())).tryAutoSpawn as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context_config__bindgen_ty_2),
            "::",
            stringify!(tryAutoSpawn)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_context_config__bindgen_ty_3 {
    pub sessionCategory: ma_ios_session_category,
    pub sessionCategoryOptions: ma_uint32,
    pub noAudioSessionActivate: ma_bool32,
    pub noAudioSessionDeactivate: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_context_config__bindgen_ty_3() {
    assert_eq!(
        ::core::mem::size_of::<ma_context_config__bindgen_ty_3>(),
        16usize,
        concat!("Size of: ", stringify!(ma_context_config__bindgen_ty_3))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_context_config__bindgen_ty_3>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_context_config__bindgen_ty_3))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context_config__bindgen_ty_3>())).sessionCategory as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context_config__bindgen_ty_3),
            "::",
            stringify!(sessionCategory)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context_config__bindgen_ty_3>())).sessionCategoryOptions
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context_config__bindgen_ty_3),
            "::",
            stringify!(sessionCategoryOptions)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context_config__bindgen_ty_3>())).noAudioSessionActivate
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context_config__bindgen_ty_3),
            "::",
            stringify!(noAudioSessionActivate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context_config__bindgen_ty_3>())).noAudioSessionDeactivate
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context_config__bindgen_ty_3),
            "::",
            stringify!(noAudioSessionDeactivate)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_context_config__bindgen_ty_4 {
    pub pClientName: *const libc::c_char,
    pub tryStartServer: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_context_config__bindgen_ty_4() {
    assert_eq!(
        ::core::mem::size_of::<ma_context_config__bindgen_ty_4>(),
        16usize,
        concat!("Size of: ", stringify!(ma_context_config__bindgen_ty_4))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_context_config__bindgen_ty_4>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_context_config__bindgen_ty_4))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context_config__bindgen_ty_4>())).pClientName as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context_config__bindgen_ty_4),
            "::",
            stringify!(pClientName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context_config__bindgen_ty_4>())).tryStartServer as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context_config__bindgen_ty_4),
            "::",
            stringify!(tryStartServer)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_context_config() {
    assert_eq!(
        ::core::mem::size_of::<ma_context_config>(),
        128usize,
        concat!("Size of: ", stringify!(ma_context_config))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_context_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_context_config))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context_config>())).logCallback as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context_config),
            "::",
            stringify!(logCallback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context_config>())).threadPriority as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context_config),
            "::",
            stringify!(threadPriority)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context_config>())).threadStackSize as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context_config),
            "::",
            stringify!(threadStackSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context_config>())).pUserData as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context_config),
            "::",
            stringify!(pUserData)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context_config>())).allocationCallbacks as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context_config),
            "::",
            stringify!(allocationCallbacks)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context_config>())).alsa as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context_config),
            "::",
            stringify!(alsa)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context_config>())).pulse as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context_config),
            "::",
            stringify!(pulse)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context_config>())).coreaudio as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context_config),
            "::",
            stringify!(coreaudio)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context_config>())).jack as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context_config),
            "::",
            stringify!(jack)
        )
    );
}
pub type ma_enum_devices_callback_proc = ::core::option::Option<
    unsafe extern "C" fn(
        pContext: *mut ma_context,
        deviceType: ma_device_type,
        pInfo: *const ma_device_info,
        pUserData: *mut libc::c_void,
    ) -> ma_bool32,
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_context {
    pub backend: ma_backend,
    pub logCallback: ma_log_proc,
    pub threadPriority: ma_thread_priority,
    pub threadStackSize: usize,
    pub pUserData: *mut libc::c_void,
    pub allocationCallbacks: ma_allocation_callbacks,
    pub deviceEnumLock: ma_mutex,
    pub deviceInfoLock: ma_mutex,
    pub deviceInfoCapacity: ma_uint32,
    pub playbackDeviceInfoCount: ma_uint32,
    pub captureDeviceInfoCount: ma_uint32,
    pub pDeviceInfos: *mut ma_device_info,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    pub onUninit:
        ::core::option::Option<unsafe extern "C" fn(pContext: *mut ma_context) -> ma_result>,
    pub onDeviceIDEqual: ::core::option::Option<
        unsafe extern "C" fn(
            pContext: *mut ma_context,
            pID0: *const ma_device_id,
            pID1: *const ma_device_id,
        ) -> ma_bool32,
    >,
    pub onEnumDevices: ::core::option::Option<
        unsafe extern "C" fn(
            pContext: *mut ma_context,
            callback: ma_enum_devices_callback_proc,
            pUserData: *mut libc::c_void,
        ) -> ma_result,
    >,
    pub onGetDeviceInfo: ::core::option::Option<
        unsafe extern "C" fn(
            pContext: *mut ma_context,
            deviceType: ma_device_type,
            pDeviceID: *const ma_device_id,
            shareMode: ma_share_mode,
            pDeviceInfo: *mut ma_device_info,
        ) -> ma_result,
    >,
    pub onDeviceInit: ::core::option::Option<
        unsafe extern "C" fn(
            pContext: *mut ma_context,
            pConfig: *const ma_device_config,
            pDevice: *mut ma_device,
        ) -> ma_result,
    >,
    pub onDeviceUninit: ::core::option::Option<unsafe extern "C" fn(pDevice: *mut ma_device)>,
    pub onDeviceStart:
        ::core::option::Option<unsafe extern "C" fn(pDevice: *mut ma_device) -> ma_result>,
    pub onDeviceStop:
        ::core::option::Option<unsafe extern "C" fn(pDevice: *mut ma_device) -> ma_result>,
    pub onDeviceMainLoop:
        ::core::option::Option<unsafe extern "C" fn(pDevice: *mut ma_device) -> ma_result>,
    pub __bindgen_anon_1: ma_context__bindgen_ty_1,
    pub __bindgen_anon_2: ma_context__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_context__bindgen_ty_1 {
    pub wasapi: ma_context__bindgen_ty_1__bindgen_ty_1,
    pub dsound: ma_context__bindgen_ty_1__bindgen_ty_2,
    pub winmm: ma_context__bindgen_ty_1__bindgen_ty_3,
    pub jack: ma_context__bindgen_ty_1__bindgen_ty_4,
    pub null_backend: ma_context__bindgen_ty_1__bindgen_ty_5,
    _bindgen_union_align: [u64; 19usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_context__bindgen_ty_1__bindgen_ty_1 {
    pub _unused: libc::c_int,
}
#[test]
fn bindgen_test_layout_ma_context__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ma_context__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<ma_context__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_1>()))._unused as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_unused)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_context__bindgen_ty_1__bindgen_ty_2 {
    pub hDSoundDLL: ma_handle,
    pub DirectSoundCreate: ma_proc,
    pub DirectSoundEnumerateA: ma_proc,
    pub DirectSoundCaptureCreate: ma_proc,
    pub DirectSoundCaptureEnumerateA: ma_proc,
}
#[test]
fn bindgen_test_layout_ma_context__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<ma_context__bindgen_ty_1__bindgen_ty_2>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<ma_context__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_2>())).hDSoundDLL
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(hDSoundDLL)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_2>())).DirectSoundCreate
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(DirectSoundCreate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_2>()))
                .DirectSoundEnumerateA as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(DirectSoundEnumerateA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_2>()))
                .DirectSoundCaptureCreate as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(DirectSoundCaptureCreate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_2>()))
                .DirectSoundCaptureEnumerateA as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(DirectSoundCaptureEnumerateA)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_context__bindgen_ty_1__bindgen_ty_3 {
    pub hWinMM: ma_handle,
    pub waveOutGetNumDevs: ma_proc,
    pub waveOutGetDevCapsA: ma_proc,
    pub waveOutOpen: ma_proc,
    pub waveOutClose: ma_proc,
    pub waveOutPrepareHeader: ma_proc,
    pub waveOutUnprepareHeader: ma_proc,
    pub waveOutWrite: ma_proc,
    pub waveOutReset: ma_proc,
    pub waveInGetNumDevs: ma_proc,
    pub waveInGetDevCapsA: ma_proc,
    pub waveInOpen: ma_proc,
    pub waveInClose: ma_proc,
    pub waveInPrepareHeader: ma_proc,
    pub waveInUnprepareHeader: ma_proc,
    pub waveInAddBuffer: ma_proc,
    pub waveInStart: ma_proc,
    pub waveInReset: ma_proc,
}
#[test]
fn bindgen_test_layout_ma_context__bindgen_ty_1__bindgen_ty_3() {
    assert_eq!(
        ::core::mem::size_of::<ma_context__bindgen_ty_1__bindgen_ty_3>(),
        144usize,
        concat!(
            "Size of: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<ma_context__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_3>())).hWinMM as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(hWinMM)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_3>())).waveOutGetNumDevs
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(waveOutGetNumDevs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_3>())).waveOutGetDevCapsA
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(waveOutGetDevCapsA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_3>())).waveOutOpen
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(waveOutOpen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_3>())).waveOutClose
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(waveOutClose)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_3>())).waveOutPrepareHeader
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(waveOutPrepareHeader)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_3>()))
                .waveOutUnprepareHeader as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(waveOutUnprepareHeader)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_3>())).waveOutWrite
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(waveOutWrite)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_3>())).waveOutReset
                as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(waveOutReset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_3>())).waveInGetNumDevs
                as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(waveInGetNumDevs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_3>())).waveInGetDevCapsA
                as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(waveInGetDevCapsA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_3>())).waveInOpen
                as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(waveInOpen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_3>())).waveInClose
                as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(waveInClose)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_3>())).waveInPrepareHeader
                as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(waveInPrepareHeader)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_3>()))
                .waveInUnprepareHeader as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(waveInUnprepareHeader)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_3>())).waveInAddBuffer
                as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(waveInAddBuffer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_3>())).waveInStart
                as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(waveInStart)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_3>())).waveInReset
                as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(waveInReset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_context__bindgen_ty_1__bindgen_ty_4 {
    pub jackSO: ma_handle,
    pub jack_client_open: ma_proc,
    pub jack_client_close: ma_proc,
    pub jack_client_name_size: ma_proc,
    pub jack_set_process_callback: ma_proc,
    pub jack_set_buffer_size_callback: ma_proc,
    pub jack_on_shutdown: ma_proc,
    pub jack_get_sample_rate: ma_proc,
    pub jack_get_buffer_size: ma_proc,
    pub jack_get_ports: ma_proc,
    pub jack_activate: ma_proc,
    pub jack_deactivate: ma_proc,
    pub jack_connect: ma_proc,
    pub jack_port_register: ma_proc,
    pub jack_port_name: ma_proc,
    pub jack_port_get_buffer: ma_proc,
    pub jack_free: ma_proc,
    pub pClientName: *mut libc::c_char,
    pub tryStartServer: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_context__bindgen_ty_1__bindgen_ty_4() {
    assert_eq!(
        ::core::mem::size_of::<ma_context__bindgen_ty_1__bindgen_ty_4>(),
        152usize,
        concat!(
            "Size of: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<ma_context__bindgen_ty_1__bindgen_ty_4>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_4>())).jackSO as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(jackSO)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_4>())).jack_client_open
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(jack_client_open)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_4>())).jack_client_close
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(jack_client_close)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_4>()))
                .jack_client_name_size as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(jack_client_name_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_4>()))
                .jack_set_process_callback as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(jack_set_process_callback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_4>()))
                .jack_set_buffer_size_callback as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(jack_set_buffer_size_callback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_4>())).jack_on_shutdown
                as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(jack_on_shutdown)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_4>())).jack_get_sample_rate
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(jack_get_sample_rate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_4>())).jack_get_buffer_size
                as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(jack_get_buffer_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_4>())).jack_get_ports
                as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(jack_get_ports)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_4>())).jack_activate
                as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(jack_activate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_4>())).jack_deactivate
                as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(jack_deactivate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_4>())).jack_connect
                as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(jack_connect)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_4>())).jack_port_register
                as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(jack_port_register)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_4>())).jack_port_name
                as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(jack_port_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_4>())).jack_port_get_buffer
                as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(jack_port_get_buffer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_4>())).jack_free
                as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(jack_free)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_4>())).pClientName
                as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(pClientName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_4>())).tryStartServer
                as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(tryStartServer)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_context__bindgen_ty_1__bindgen_ty_5 {
    pub _unused: libc::c_int,
}
#[test]
fn bindgen_test_layout_ma_context__bindgen_ty_1__bindgen_ty_5() {
    assert_eq!(
        ::core::mem::size_of::<ma_context__bindgen_ty_1__bindgen_ty_5>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_5)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<ma_context__bindgen_ty_1__bindgen_ty_5>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_5)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1__bindgen_ty_5>()))._unused as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(_unused)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_context__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ma_context__bindgen_ty_1>(),
        152usize,
        concat!("Size of: ", stringify!(ma_context__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_context__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_context__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1>())).wasapi as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1),
            "::",
            stringify!(wasapi)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1>())).dsound as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1),
            "::",
            stringify!(dsound)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context__bindgen_ty_1>())).winmm as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1),
            "::",
            stringify!(winmm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context__bindgen_ty_1>())).jack as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1),
            "::",
            stringify!(jack)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_1>())).null_backend as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_1),
            "::",
            stringify!(null_backend)
        )
    );
}
impl ::core::fmt::Debug for ma_context__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "ma_context__bindgen_ty_1 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_context__bindgen_ty_2 {
    pub win32: ma_context__bindgen_ty_2__bindgen_ty_1,
    pub _unused: libc::c_int,
    _bindgen_union_align: [u64; 14usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_context__bindgen_ty_2__bindgen_ty_1 {
    pub hOle32DLL: ma_handle,
    pub CoInitializeEx: ma_proc,
    pub CoUninitialize: ma_proc,
    pub CoCreateInstance: ma_proc,
    pub CoTaskMemFree: ma_proc,
    pub PropVariantClear: ma_proc,
    pub StringFromGUID2: ma_proc,
    pub hUser32DLL: ma_handle,
    pub GetForegroundWindow: ma_proc,
    pub GetDesktopWindow: ma_proc,
    pub hAdvapi32DLL: ma_handle,
    pub RegOpenKeyExA: ma_proc,
    pub RegCloseKey: ma_proc,
    pub RegQueryValueExA: ma_proc,
}
#[test]
fn bindgen_test_layout_ma_context__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ma_context__bindgen_ty_2__bindgen_ty_1>(),
        112usize,
        concat!(
            "Size of: ",
            stringify!(ma_context__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<ma_context__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ma_context__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_2__bindgen_ty_1>())).hOle32DLL
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(hOle32DLL)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_2__bindgen_ty_1>())).CoInitializeEx
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(CoInitializeEx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_2__bindgen_ty_1>())).CoUninitialize
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(CoUninitialize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_2__bindgen_ty_1>())).CoCreateInstance
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(CoCreateInstance)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_2__bindgen_ty_1>())).CoTaskMemFree
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(CoTaskMemFree)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_2__bindgen_ty_1>())).PropVariantClear
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(PropVariantClear)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_2__bindgen_ty_1>())).StringFromGUID2
                as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(StringFromGUID2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_2__bindgen_ty_1>())).hUser32DLL
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(hUser32DLL)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_2__bindgen_ty_1>())).GetForegroundWindow
                as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(GetForegroundWindow)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_2__bindgen_ty_1>())).GetDesktopWindow
                as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(GetDesktopWindow)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_2__bindgen_ty_1>())).hAdvapi32DLL
                as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(hAdvapi32DLL)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_2__bindgen_ty_1>())).RegOpenKeyExA
                as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(RegOpenKeyExA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_2__bindgen_ty_1>())).RegCloseKey
                as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(RegCloseKey)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_2__bindgen_ty_1>())).RegQueryValueExA
                as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(RegQueryValueExA)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_context__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<ma_context__bindgen_ty_2>(),
        112usize,
        concat!("Size of: ", stringify!(ma_context__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_context__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_context__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context__bindgen_ty_2>())).win32 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_2),
            "::",
            stringify!(win32)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context__bindgen_ty_2>()))._unused as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context__bindgen_ty_2),
            "::",
            stringify!(_unused)
        )
    );
}
impl ::core::fmt::Debug for ma_context__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "ma_context__bindgen_ty_2 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_ma_context() {
    assert_eq!(
        ::core::mem::size_of::<ma_context>(),
        456usize,
        concat!("Size of: ", stringify!(ma_context))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_context>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_context))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context>())).backend as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(backend)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context>())).logCallback as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(logCallback)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context>())).threadPriority as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(threadPriority)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context>())).threadStackSize as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(threadStackSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context>())).pUserData as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(pUserData)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context>())).allocationCallbacks as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(allocationCallbacks)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context>())).deviceEnumLock as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(deviceEnumLock)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context>())).deviceInfoLock as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(deviceInfoLock)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context>())).deviceInfoCapacity as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(deviceInfoCapacity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context>())).playbackDeviceInfoCount as *const _ as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(playbackDeviceInfoCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_context>())).captureDeviceInfoCount as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(captureDeviceInfoCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context>())).pDeviceInfos as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(pDeviceInfos)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context>())).onUninit as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(onUninit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context>())).onDeviceIDEqual as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(onDeviceIDEqual)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context>())).onEnumDevices as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(onEnumDevices)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context>())).onGetDeviceInfo as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(onGetDeviceInfo)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context>())).onDeviceInit as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(onDeviceInit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context>())).onDeviceUninit as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(onDeviceUninit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context>())).onDeviceStart as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(onDeviceStart)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context>())).onDeviceStop as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(onDeviceStop)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_context>())).onDeviceMainLoop as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_context),
            "::",
            stringify!(onDeviceMainLoop)
        )
    );
}
impl ::core::fmt::Debug for ma_context {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write ! (f , "ma_context {{ backend: {:?}, logCallback: {:?}, threadPriority: {:?}, threadStackSize: {:?}, pUserData: {:?}, allocationCallbacks: {:?}, deviceEnumLock: {:?}, deviceInfoLock: {:?}, deviceInfoCapacity: {:?}, playbackDeviceInfoCount: {:?}, captureDeviceInfoCount: {:?}, pDeviceInfos: {:?}, isBackendAsynchronous : {:?}, onUninit: {:?}, onDeviceIDEqual: {:?}, onEnumDevices: {:?}, onGetDeviceInfo: {:?}, onDeviceInit: {:?}, onDeviceUninit: {:?}, onDeviceStart: {:?}, onDeviceStop: {:?}, onDeviceMainLoop: {:?}, __bindgen_anon_1: {:?}, __bindgen_anon_2: {:?} }}" , self . backend , self . logCallback , self . threadPriority , self . threadStackSize , self . pUserData , self . allocationCallbacks , self . deviceEnumLock , self . deviceInfoLock , self . deviceInfoCapacity , self . playbackDeviceInfoCount , self . captureDeviceInfoCount , self . pDeviceInfos , self . isBackendAsynchronous () , self . onUninit , self . onDeviceIDEqual , self . onEnumDevices , self . onGetDeviceInfo , self . onDeviceInit , self . onDeviceUninit , self . onDeviceStart , self . onDeviceStop , self . onDeviceMainLoop , self . __bindgen_anon_1 , self . __bindgen_anon_2)
    }
}
impl ma_context {
    #[inline]
    pub fn isBackendAsynchronous(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_isBackendAsynchronous(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        isBackendAsynchronous: ma_bool32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let isBackendAsynchronous: u32 =
                unsafe { ::core::mem::transmute(isBackendAsynchronous) };
            isBackendAsynchronous as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_device {
    pub pContext: *mut ma_context,
    pub type_: ma_device_type,
    pub sampleRate: ma_uint32,
    pub state: ma_uint32,
    pub onData: ma_device_callback_proc,
    pub onStop: ma_stop_proc,
    pub pUserData: *mut libc::c_void,
    pub lock: ma_mutex,
    pub wakeupEvent: ma_event,
    pub startEvent: ma_event,
    pub stopEvent: ma_event,
    pub thread: ma_thread,
    pub workResult: ma_result,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    pub masterVolumeFactor: f32,
    pub resampling: ma_device__bindgen_ty_1,
    pub playback: ma_device__bindgen_ty_2,
    pub capture: ma_device__bindgen_ty_3,
    pub __bindgen_anon_1: ma_device__bindgen_ty_4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device__bindgen_ty_1 {
    pub algorithm: ma_resample_algorithm,
    pub linear: ma_device__bindgen_ty_1__bindgen_ty_1,
    pub speex: ma_device__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device__bindgen_ty_1__bindgen_ty_1 {
    pub lpfOrder: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_device__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ma_device__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(ma_device__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ma_device__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_1__bindgen_ty_1>())).lpfOrder as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(lpfOrder)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device__bindgen_ty_1__bindgen_ty_2 {
    pub quality: libc::c_int,
}
#[test]
fn bindgen_test_layout_ma_device__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<ma_device__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(ma_device__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ma_device__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_1__bindgen_ty_2>())).quality as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(quality)
        )
    );
}
#[test]
fn bindgen_test_layout_ma_device__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ma_device__bindgen_ty_1>(),
        12usize,
        concat!("Size of: ", stringify!(ma_device__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_device__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_1>())).algorithm as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_1),
            "::",
            stringify!(algorithm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device__bindgen_ty_1>())).linear as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_1),
            "::",
            stringify!(linear)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device__bindgen_ty_1>())).speex as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_1),
            "::",
            stringify!(speex)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_device__bindgen_ty_2 {
    pub id: ma_device_id,
    pub name: [libc::c_char; 256usize],
    pub shareMode: ma_share_mode,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    pub format: ma_format,
    pub channels: ma_uint32,
    pub channelMap: [ma_channel; 32usize],
    pub internalFormat: ma_format,
    pub internalChannels: ma_uint32,
    pub internalSampleRate: ma_uint32,
    pub internalChannelMap: [ma_channel; 32usize],
    pub internalPeriodSizeInFrames: ma_uint32,
    pub internalPeriods: ma_uint32,
    pub converter: ma_data_converter,
}
#[test]
fn bindgen_test_layout_ma_device__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<ma_device__bindgen_ty_2>(),
        10712usize,
        concat!("Size of: ", stringify!(ma_device__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_device__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device__bindgen_ty_2>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_2),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device__bindgen_ty_2>())).name as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_2),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_2>())).shareMode as *const _ as usize
        },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_2),
            "::",
            stringify!(shareMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device__bindgen_ty_2>())).format as *const _ as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_2),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_2>())).channels as *const _ as usize
        },
        524usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_2),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_2>())).channelMap as *const _ as usize
        },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_2),
            "::",
            stringify!(channelMap)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_2>())).internalFormat as *const _ as usize
        },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_2),
            "::",
            stringify!(internalFormat)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_2>())).internalChannels as *const _
                as usize
        },
        564usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_2),
            "::",
            stringify!(internalChannels)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_2>())).internalSampleRate as *const _
                as usize
        },
        568usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_2),
            "::",
            stringify!(internalSampleRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_2>())).internalChannelMap as *const _
                as usize
        },
        572usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_2),
            "::",
            stringify!(internalChannelMap)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_2>())).internalPeriodSizeInFrames
                as *const _ as usize
        },
        604usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_2),
            "::",
            stringify!(internalPeriodSizeInFrames)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_2>())).internalPeriods as *const _
                as usize
        },
        608usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_2),
            "::",
            stringify!(internalPeriods)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_2>())).converter as *const _ as usize
        },
        616usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_2),
            "::",
            stringify!(converter)
        )
    );
}
impl ::core::fmt::Debug for ma_device__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write ! (f , "ma_device__bindgen_ty_2 {{ id: {:?}, name: [...], shareMode: {:?}, usingDefaultFormat : {:?}, usingDefaultChannels : {:?}, usingDefaultChannelMap : {:?}, format: {:?}, channels: {:?}, channelMap: [...], internalFormat: {:?}, internalChannels: {:?}, internalSampleRate: {:?}, internalChannelMap: [...], internalPeriodSizeInFrames: {:?}, internalPeriods: {:?}, converter: {:?} }}" , self . id , self . shareMode , self . usingDefaultFormat () , self . usingDefaultChannels () , self . usingDefaultChannelMap () , self . format , self . channels , self . internalFormat , self . internalChannels , self . internalSampleRate , self . internalPeriodSizeInFrames , self . internalPeriods , self . converter)
    }
}
impl ma_device__bindgen_ty_2 {
    #[inline]
    pub fn usingDefaultFormat(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_usingDefaultFormat(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn usingDefaultChannels(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_usingDefaultChannels(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn usingDefaultChannelMap(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_usingDefaultChannelMap(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        usingDefaultFormat: ma_bool32,
        usingDefaultChannels: ma_bool32,
        usingDefaultChannelMap: ma_bool32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let usingDefaultFormat: u32 = unsafe { ::core::mem::transmute(usingDefaultFormat) };
            usingDefaultFormat as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let usingDefaultChannels: u32 = unsafe { ::core::mem::transmute(usingDefaultChannels) };
            usingDefaultChannels as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let usingDefaultChannelMap: u32 =
                unsafe { ::core::mem::transmute(usingDefaultChannelMap) };
            usingDefaultChannelMap as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_device__bindgen_ty_3 {
    pub id: ma_device_id,
    pub name: [libc::c_char; 256usize],
    pub shareMode: ma_share_mode,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    pub format: ma_format,
    pub channels: ma_uint32,
    pub channelMap: [ma_channel; 32usize],
    pub internalFormat: ma_format,
    pub internalChannels: ma_uint32,
    pub internalSampleRate: ma_uint32,
    pub internalChannelMap: [ma_channel; 32usize],
    pub internalPeriodSizeInFrames: ma_uint32,
    pub internalPeriods: ma_uint32,
    pub converter: ma_data_converter,
}
#[test]
fn bindgen_test_layout_ma_device__bindgen_ty_3() {
    assert_eq!(
        ::core::mem::size_of::<ma_device__bindgen_ty_3>(),
        10712usize,
        concat!("Size of: ", stringify!(ma_device__bindgen_ty_3))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device__bindgen_ty_3>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_device__bindgen_ty_3))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device__bindgen_ty_3>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_3),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device__bindgen_ty_3>())).name as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_3),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_3>())).shareMode as *const _ as usize
        },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_3),
            "::",
            stringify!(shareMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device__bindgen_ty_3>())).format as *const _ as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_3),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_3>())).channels as *const _ as usize
        },
        524usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_3),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_3>())).channelMap as *const _ as usize
        },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_3),
            "::",
            stringify!(channelMap)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_3>())).internalFormat as *const _ as usize
        },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_3),
            "::",
            stringify!(internalFormat)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_3>())).internalChannels as *const _
                as usize
        },
        564usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_3),
            "::",
            stringify!(internalChannels)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_3>())).internalSampleRate as *const _
                as usize
        },
        568usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_3),
            "::",
            stringify!(internalSampleRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_3>())).internalChannelMap as *const _
                as usize
        },
        572usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_3),
            "::",
            stringify!(internalChannelMap)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_3>())).internalPeriodSizeInFrames
                as *const _ as usize
        },
        604usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_3),
            "::",
            stringify!(internalPeriodSizeInFrames)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_3>())).internalPeriods as *const _
                as usize
        },
        608usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_3),
            "::",
            stringify!(internalPeriods)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_3>())).converter as *const _ as usize
        },
        616usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_3),
            "::",
            stringify!(converter)
        )
    );
}
impl ::core::fmt::Debug for ma_device__bindgen_ty_3 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write ! (f , "ma_device__bindgen_ty_3 {{ id: {:?}, name: [...], shareMode: {:?}, usingDefaultFormat : {:?}, usingDefaultChannels : {:?}, usingDefaultChannelMap : {:?}, format: {:?}, channels: {:?}, channelMap: [...], internalFormat: {:?}, internalChannels: {:?}, internalSampleRate: {:?}, internalChannelMap: [...], internalPeriodSizeInFrames: {:?}, internalPeriods: {:?}, converter: {:?} }}" , self . id , self . shareMode , self . usingDefaultFormat () , self . usingDefaultChannels () , self . usingDefaultChannelMap () , self . format , self . channels , self . internalFormat , self . internalChannels , self . internalSampleRate , self . internalPeriodSizeInFrames , self . internalPeriods , self . converter)
    }
}
impl ma_device__bindgen_ty_3 {
    #[inline]
    pub fn usingDefaultFormat(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_usingDefaultFormat(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn usingDefaultChannels(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_usingDefaultChannels(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn usingDefaultChannelMap(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_usingDefaultChannelMap(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        usingDefaultFormat: ma_bool32,
        usingDefaultChannels: ma_bool32,
        usingDefaultChannelMap: ma_bool32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let usingDefaultFormat: u32 = unsafe { ::core::mem::transmute(usingDefaultFormat) };
            usingDefaultFormat as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let usingDefaultChannels: u32 = unsafe { ::core::mem::transmute(usingDefaultChannels) };
            usingDefaultChannels as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let usingDefaultChannelMap: u32 =
                unsafe { ::core::mem::transmute(usingDefaultChannelMap) };
            usingDefaultChannelMap as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_device__bindgen_ty_4 {
    pub wasapi: ma_device__bindgen_ty_4__bindgen_ty_1,
    pub dsound: ma_device__bindgen_ty_4__bindgen_ty_2,
    pub winmm: ma_device__bindgen_ty_4__bindgen_ty_3,
    pub jack: ma_device__bindgen_ty_4__bindgen_ty_4,
    pub null_device: ma_device__bindgen_ty_4__bindgen_ty_5,
    _bindgen_union_align: [u64; 76usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device__bindgen_ty_4__bindgen_ty_1 {
    pub pAudioClientPlayback: ma_ptr,
    pub pAudioClientCapture: ma_ptr,
    pub pRenderClient: ma_ptr,
    pub pCaptureClient: ma_ptr,
    pub pDeviceEnumerator: ma_ptr,
    pub notificationClient: ma_IMMNotificationClient,
    pub hEventPlayback: ma_handle,
    pub hEventCapture: ma_handle,
    pub actualPeriodSizeInFramesPlayback: ma_uint32,
    pub actualPeriodSizeInFramesCapture: ma_uint32,
    pub originalPeriodSizeInFrames: ma_uint32,
    pub originalPeriodSizeInMilliseconds: ma_uint32,
    pub originalPeriods: ma_uint32,
    pub hasDefaultPlaybackDeviceChanged: ma_bool32,
    pub hasDefaultCaptureDeviceChanged: ma_bool32,
    pub periodSizeInFramesPlayback: ma_uint32,
    pub periodSizeInFramesCapture: ma_uint32,
    pub isStartedCapture: ma_bool32,
    pub isStartedPlayback: ma_bool32,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_ma_device__bindgen_ty_4__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ma_device__bindgen_ty_4__bindgen_ty_1>(),
        128usize,
        concat!(
            "Size of: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device__bindgen_ty_4__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_1>())).pAudioClientPlayback
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(pAudioClientPlayback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_1>())).pAudioClientCapture
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(pAudioClientCapture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_1>())).pRenderClient
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(pRenderClient)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_1>())).pCaptureClient
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(pCaptureClient)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_1>())).pDeviceEnumerator
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(pDeviceEnumerator)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_1>())).notificationClient
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(notificationClient)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_1>())).hEventPlayback
                as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(hEventPlayback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_1>())).hEventCapture
                as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(hEventCapture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_1>()))
                .actualPeriodSizeInFramesPlayback as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(actualPeriodSizeInFramesPlayback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_1>()))
                .actualPeriodSizeInFramesCapture as *const _ as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(actualPeriodSizeInFramesCapture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_1>()))
                .originalPeriodSizeInFrames as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(originalPeriodSizeInFrames)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_1>()))
                .originalPeriodSizeInMilliseconds as *const _ as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(originalPeriodSizeInMilliseconds)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_1>())).originalPeriods
                as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(originalPeriods)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_1>()))
                .hasDefaultPlaybackDeviceChanged as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(hasDefaultPlaybackDeviceChanged)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_1>()))
                .hasDefaultCaptureDeviceChanged as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(hasDefaultCaptureDeviceChanged)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_1>()))
                .periodSizeInFramesPlayback as *const _ as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(periodSizeInFramesPlayback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_1>()))
                .periodSizeInFramesCapture as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(periodSizeInFramesCapture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_1>())).isStartedCapture
                as *const _ as usize
        },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(isStartedCapture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_1>())).isStartedPlayback
                as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(isStartedPlayback)
        )
    );
}
impl ma_device__bindgen_ty_4__bindgen_ty_1 {
    #[inline]
    pub fn noAutoConvertSRC(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_noAutoConvertSRC(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn noDefaultQualitySRC(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_noDefaultQualitySRC(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn noHardwareOffloading(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_noHardwareOffloading(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn allowCaptureAutoStreamRouting(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_allowCaptureAutoStreamRouting(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn allowPlaybackAutoStreamRouting(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_allowPlaybackAutoStreamRouting(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        noAutoConvertSRC: ma_bool32,
        noDefaultQualitySRC: ma_bool32,
        noHardwareOffloading: ma_bool32,
        allowCaptureAutoStreamRouting: ma_bool32,
        allowPlaybackAutoStreamRouting: ma_bool32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let noAutoConvertSRC: u32 = unsafe { ::core::mem::transmute(noAutoConvertSRC) };
            noAutoConvertSRC as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let noDefaultQualitySRC: u32 = unsafe { ::core::mem::transmute(noDefaultQualitySRC) };
            noDefaultQualitySRC as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let noHardwareOffloading: u32 = unsafe { ::core::mem::transmute(noHardwareOffloading) };
            noHardwareOffloading as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let allowCaptureAutoStreamRouting: u32 =
                unsafe { ::core::mem::transmute(allowCaptureAutoStreamRouting) };
            allowCaptureAutoStreamRouting as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let allowPlaybackAutoStreamRouting: u32 =
                unsafe { ::core::mem::transmute(allowPlaybackAutoStreamRouting) };
            allowPlaybackAutoStreamRouting as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device__bindgen_ty_4__bindgen_ty_2 {
    pub pPlayback: ma_ptr,
    pub pPlaybackPrimaryBuffer: ma_ptr,
    pub pPlaybackBuffer: ma_ptr,
    pub pCapture: ma_ptr,
    pub pCaptureBuffer: ma_ptr,
}
#[test]
fn bindgen_test_layout_ma_device__bindgen_ty_4__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<ma_device__bindgen_ty_4__bindgen_ty_2>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device__bindgen_ty_4__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_2>())).pPlayback as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_2),
            "::",
            stringify!(pPlayback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_2>()))
                .pPlaybackPrimaryBuffer as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_2),
            "::",
            stringify!(pPlaybackPrimaryBuffer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_2>())).pPlaybackBuffer
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_2),
            "::",
            stringify!(pPlaybackBuffer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_2>())).pCapture as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_2),
            "::",
            stringify!(pCapture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_2>())).pCaptureBuffer
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_2),
            "::",
            stringify!(pCaptureBuffer)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device__bindgen_ty_4__bindgen_ty_3 {
    pub hDevicePlayback: ma_handle,
    pub hDeviceCapture: ma_handle,
    pub hEventPlayback: ma_handle,
    pub hEventCapture: ma_handle,
    pub fragmentSizeInFrames: ma_uint32,
    pub iNextHeaderPlayback: ma_uint32,
    pub iNextHeaderCapture: ma_uint32,
    pub headerFramesConsumedPlayback: ma_uint32,
    pub headerFramesConsumedCapture: ma_uint32,
    pub pWAVEHDRPlayback: *mut ma_uint8,
    pub pWAVEHDRCapture: *mut ma_uint8,
    pub pIntermediaryBufferPlayback: *mut ma_uint8,
    pub pIntermediaryBufferCapture: *mut ma_uint8,
    pub _pHeapData: *mut ma_uint8,
}
#[test]
fn bindgen_test_layout_ma_device__bindgen_ty_4__bindgen_ty_3() {
    assert_eq!(
        ::core::mem::size_of::<ma_device__bindgen_ty_4__bindgen_ty_3>(),
        96usize,
        concat!(
            "Size of: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device__bindgen_ty_4__bindgen_ty_3>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_3>())).hDevicePlayback
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_3),
            "::",
            stringify!(hDevicePlayback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_3>())).hDeviceCapture
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_3),
            "::",
            stringify!(hDeviceCapture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_3>())).hEventPlayback
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_3),
            "::",
            stringify!(hEventPlayback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_3>())).hEventCapture
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_3),
            "::",
            stringify!(hEventCapture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_3>())).fragmentSizeInFrames
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_3),
            "::",
            stringify!(fragmentSizeInFrames)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_3>())).iNextHeaderPlayback
                as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_3),
            "::",
            stringify!(iNextHeaderPlayback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_3>())).iNextHeaderCapture
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_3),
            "::",
            stringify!(iNextHeaderCapture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_3>()))
                .headerFramesConsumedPlayback as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_3),
            "::",
            stringify!(headerFramesConsumedPlayback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_3>()))
                .headerFramesConsumedCapture as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_3),
            "::",
            stringify!(headerFramesConsumedCapture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_3>())).pWAVEHDRPlayback
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_3),
            "::",
            stringify!(pWAVEHDRPlayback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_3>())).pWAVEHDRCapture
                as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_3),
            "::",
            stringify!(pWAVEHDRCapture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_3>()))
                .pIntermediaryBufferPlayback as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_3),
            "::",
            stringify!(pIntermediaryBufferPlayback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_3>()))
                .pIntermediaryBufferCapture as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_3),
            "::",
            stringify!(pIntermediaryBufferCapture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_3>()))._pHeapData
                as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_3),
            "::",
            stringify!(_pHeapData)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device__bindgen_ty_4__bindgen_ty_4 {
    pub pClient: ma_ptr,
    pub pPortsPlayback: [ma_ptr; 32usize],
    pub pPortsCapture: [ma_ptr; 32usize],
    pub pIntermediaryBufferPlayback: *mut f32,
    pub pIntermediaryBufferCapture: *mut f32,
    pub duplexRB: ma_pcm_rb,
}
#[test]
fn bindgen_test_layout_ma_device__bindgen_ty_4__bindgen_ty_4() {
    assert_eq!(
        ::core::mem::size_of::<ma_device__bindgen_ty_4__bindgen_ty_4>(),
        608usize,
        concat!(
            "Size of: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_4)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device__bindgen_ty_4__bindgen_ty_4>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_4>())).pClient as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_4),
            "::",
            stringify!(pClient)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_4>())).pPortsPlayback
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_4),
            "::",
            stringify!(pPortsPlayback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_4>())).pPortsCapture
                as *const _ as usize
        },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_4),
            "::",
            stringify!(pPortsCapture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_4>()))
                .pIntermediaryBufferPlayback as *const _ as usize
        },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_4),
            "::",
            stringify!(pIntermediaryBufferPlayback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_4>()))
                .pIntermediaryBufferCapture as *const _ as usize
        },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_4),
            "::",
            stringify!(pIntermediaryBufferCapture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_4>())).duplexRB as *const _
                as usize
        },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_4),
            "::",
            stringify!(duplexRB)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_device__bindgen_ty_4__bindgen_ty_5 {
    pub deviceThread: ma_thread,
    pub operationEvent: ma_event,
    pub operationCompletionEvent: ma_event,
    pub operation: ma_uint32,
    pub operationResult: ma_result,
    pub timer: ma_timer,
    pub priorRunTime: f64,
    pub currentPeriodFramesRemainingPlayback: ma_uint32,
    pub currentPeriodFramesRemainingCapture: ma_uint32,
    pub lastProcessedFramePlayback: ma_uint64,
    pub lastProcessedFrameCapture: ma_uint64,
    pub isStarted: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_device__bindgen_ty_4__bindgen_ty_5() {
    assert_eq!(
        ::core::mem::size_of::<ma_device__bindgen_ty_4__bindgen_ty_5>(),
        80usize,
        concat!(
            "Size of: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_5)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device__bindgen_ty_4__bindgen_ty_5>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_5)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_5>())).deviceThread
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_5),
            "::",
            stringify!(deviceThread)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_5>())).operationEvent
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_5),
            "::",
            stringify!(operationEvent)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_5>()))
                .operationCompletionEvent as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_5),
            "::",
            stringify!(operationCompletionEvent)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_5>())).operation as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_5),
            "::",
            stringify!(operation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_5>())).operationResult
                as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_5),
            "::",
            stringify!(operationResult)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_5>())).timer as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_5),
            "::",
            stringify!(timer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_5>())).priorRunTime
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_5),
            "::",
            stringify!(priorRunTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_5>()))
                .currentPeriodFramesRemainingPlayback as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_5),
            "::",
            stringify!(currentPeriodFramesRemainingPlayback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_5>()))
                .currentPeriodFramesRemainingCapture as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_5),
            "::",
            stringify!(currentPeriodFramesRemainingCapture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_5>()))
                .lastProcessedFramePlayback as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_5),
            "::",
            stringify!(lastProcessedFramePlayback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_5>()))
                .lastProcessedFrameCapture as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_5),
            "::",
            stringify!(lastProcessedFrameCapture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4__bindgen_ty_5>())).isStarted as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4__bindgen_ty_5),
            "::",
            stringify!(isStarted)
        )
    );
}
impl ::core::fmt::Debug for ma_device__bindgen_ty_4__bindgen_ty_5 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write ! (f , "ma_device__bindgen_ty_4__bindgen_ty_5 {{ deviceThread: {:?}, operationEvent: {:?}, operationCompletionEvent: {:?}, operation: {:?}, operationResult: {:?}, timer: {:?}, priorRunTime: {:?}, currentPeriodFramesRemainingPlayback: {:?}, currentPeriodFramesRemainingCapture: {:?}, lastProcessedFramePlayback: {:?}, lastProcessedFrameCapture: {:?}, isStarted: {:?} }}" , self . deviceThread , self . operationEvent , self . operationCompletionEvent , self . operation , self . operationResult , self . timer , self . priorRunTime , self . currentPeriodFramesRemainingPlayback , self . currentPeriodFramesRemainingCapture , self . lastProcessedFramePlayback , self . lastProcessedFrameCapture , self . isStarted)
    }
}
#[test]
fn bindgen_test_layout_ma_device__bindgen_ty_4() {
    assert_eq!(
        ::core::mem::size_of::<ma_device__bindgen_ty_4>(),
        608usize,
        concat!("Size of: ", stringify!(ma_device__bindgen_ty_4))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device__bindgen_ty_4>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_device__bindgen_ty_4))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device__bindgen_ty_4>())).wasapi as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4),
            "::",
            stringify!(wasapi)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device__bindgen_ty_4>())).dsound as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4),
            "::",
            stringify!(dsound)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device__bindgen_ty_4>())).winmm as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4),
            "::",
            stringify!(winmm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device__bindgen_ty_4>())).jack as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4),
            "::",
            stringify!(jack)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_device__bindgen_ty_4>())).null_device as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device__bindgen_ty_4),
            "::",
            stringify!(null_device)
        )
    );
}
impl ::core::fmt::Debug for ma_device__bindgen_ty_4 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "ma_device__bindgen_ty_4 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_ma_device() {
    assert_eq!(
        ::core::mem::size_of::<ma_device>(),
        22144usize,
        concat!("Size of: ", stringify!(ma_device))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_device>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_device))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device>())).pContext as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device),
            "::",
            stringify!(pContext)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device>())).type_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device>())).sampleRate as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device>())).state as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device>())).onData as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device),
            "::",
            stringify!(onData)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device>())).onStop as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device),
            "::",
            stringify!(onStop)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device>())).pUserData as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device),
            "::",
            stringify!(pUserData)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device>())).lock as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device),
            "::",
            stringify!(lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device>())).wakeupEvent as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device),
            "::",
            stringify!(wakeupEvent)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device>())).startEvent as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device),
            "::",
            stringify!(startEvent)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device>())).stopEvent as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device),
            "::",
            stringify!(stopEvent)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device>())).thread as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device),
            "::",
            stringify!(thread)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device>())).workResult as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device),
            "::",
            stringify!(workResult)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device>())).masterVolumeFactor as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device),
            "::",
            stringify!(masterVolumeFactor)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device>())).resampling as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device),
            "::",
            stringify!(resampling)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device>())).playback as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device),
            "::",
            stringify!(playback)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_device>())).capture as *const _ as usize },
        10824usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_device),
            "::",
            stringify!(capture)
        )
    );
}
impl ::core::fmt::Debug for ma_device {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write ! (f , "ma_device {{ pContext: {:?}, type: {:?}, sampleRate: {:?}, state: {:?}, onData: {:?}, onStop: {:?}, pUserData: {:?}, lock: {:?}, wakeupEvent: {:?}, startEvent: {:?}, stopEvent: {:?}, thread: {:?}, workResult: {:?}, usingDefaultSampleRate : {:?}, usingDefaultBufferSize : {:?}, usingDefaultPeriods : {:?}, isOwnerOfContext : {:?}, noPreZeroedOutputBuffer : {:?}, noClip : {:?}, masterVolumeFactor: {:?}, resampling: {:?}, playback: {:?}, capture: {:?}, __bindgen_anon_1: {:?} }}" , self . pContext , self . type_ , self . sampleRate , self . state , self . onData , self . onStop , self . pUserData , self . lock , self . wakeupEvent , self . startEvent , self . stopEvent , self . thread , self . workResult , self . usingDefaultSampleRate () , self . usingDefaultBufferSize () , self . usingDefaultPeriods () , self . isOwnerOfContext () , self . noPreZeroedOutputBuffer () , self . noClip () , self . masterVolumeFactor , self . resampling , self . playback , self . capture , self . __bindgen_anon_1)
    }
}
impl ma_device {
    #[inline]
    pub fn usingDefaultSampleRate(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_usingDefaultSampleRate(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn usingDefaultBufferSize(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_usingDefaultBufferSize(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn usingDefaultPeriods(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_usingDefaultPeriods(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn isOwnerOfContext(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_isOwnerOfContext(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn noPreZeroedOutputBuffer(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_noPreZeroedOutputBuffer(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn noClip(&self) -> ma_bool32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_noClip(&mut self, val: ma_bool32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        usingDefaultSampleRate: ma_bool32,
        usingDefaultBufferSize: ma_bool32,
        usingDefaultPeriods: ma_bool32,
        isOwnerOfContext: ma_bool32,
        noPreZeroedOutputBuffer: ma_bool32,
        noClip: ma_bool32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let usingDefaultSampleRate: u32 =
                unsafe { ::core::mem::transmute(usingDefaultSampleRate) };
            usingDefaultSampleRate as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let usingDefaultBufferSize: u32 =
                unsafe { ::core::mem::transmute(usingDefaultBufferSize) };
            usingDefaultBufferSize as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let usingDefaultPeriods: u32 = unsafe { ::core::mem::transmute(usingDefaultPeriods) };
            usingDefaultPeriods as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let isOwnerOfContext: u32 = unsafe { ::core::mem::transmute(isOwnerOfContext) };
            isOwnerOfContext as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let noPreZeroedOutputBuffer: u32 =
                unsafe { ::core::mem::transmute(noPreZeroedOutputBuffer) };
            noPreZeroedOutputBuffer as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let noClip: u32 = unsafe { ::core::mem::transmute(noClip) };
            noClip as u64
        });
        __bindgen_bitfield_unit
    }
}
extern "C" {
    pub fn ma_context_config_init() -> ma_context_config;
}
extern "C" {
    pub fn ma_context_init(
        backends: *const ma_backend,
        backendCount: ma_uint32,
        pConfig: *const ma_context_config,
        pContext: *mut ma_context,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_context_uninit(pContext: *mut ma_context) -> ma_result;
}
extern "C" {
    pub fn ma_context_sizeof() -> usize;
}
extern "C" {
    pub fn ma_context_enumerate_devices(
        pContext: *mut ma_context,
        callback: ma_enum_devices_callback_proc,
        pUserData: *mut libc::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_context_get_devices(
        pContext: *mut ma_context,
        ppPlaybackDeviceInfos: *mut *mut ma_device_info,
        pPlaybackDeviceCount: *mut ma_uint32,
        ppCaptureDeviceInfos: *mut *mut ma_device_info,
        pCaptureDeviceCount: *mut ma_uint32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_context_get_device_info(
        pContext: *mut ma_context,
        deviceType: ma_device_type,
        pDeviceID: *const ma_device_id,
        shareMode: ma_share_mode,
        pDeviceInfo: *mut ma_device_info,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_context_is_loopback_supported(pContext: *mut ma_context) -> ma_bool32;
}
extern "C" {
    pub fn ma_device_config_init(deviceType: ma_device_type) -> ma_device_config;
}
extern "C" {
    pub fn ma_device_init(
        pContext: *mut ma_context,
        pConfig: *const ma_device_config,
        pDevice: *mut ma_device,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_device_init_ex(
        backends: *const ma_backend,
        backendCount: ma_uint32,
        pContextConfig: *const ma_context_config,
        pConfig: *const ma_device_config,
        pDevice: *mut ma_device,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_device_uninit(pDevice: *mut ma_device);
}
extern "C" {
    pub fn ma_device_start(pDevice: *mut ma_device) -> ma_result;
}
extern "C" {
    pub fn ma_device_stop(pDevice: *mut ma_device) -> ma_result;
}
extern "C" {
    pub fn ma_device_is_started(pDevice: *mut ma_device) -> ma_bool32;
}
extern "C" {
    pub fn ma_device_set_master_volume(pDevice: *mut ma_device, volume: f32) -> ma_result;
}
extern "C" {
    pub fn ma_device_get_master_volume(pDevice: *mut ma_device, pVolume: *mut f32) -> ma_result;
}
extern "C" {
    pub fn ma_device_set_master_gain_db(pDevice: *mut ma_device, gainDB: f32) -> ma_result;
}
extern "C" {
    pub fn ma_device_get_master_gain_db(pDevice: *mut ma_device, pGainDB: *mut f32) -> ma_result;
}
extern "C" {
    pub fn ma_get_backend_name(backend: ma_backend) -> *const libc::c_char;
}
extern "C" {
    pub fn ma_is_backend_enabled(backend: ma_backend) -> ma_bool32;
}
extern "C" {
    pub fn ma_get_enabled_backends(
        pBackends: *mut ma_backend,
        backendCap: usize,
        pBackendCount: *mut usize,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_is_loopback_supported(backend: ma_backend) -> ma_bool32;
}
extern "C" {
    pub fn ma_spinlock_lock(pSpinlock: *mut ma_spinlock) -> ma_result;
}
extern "C" {
    pub fn ma_spinlock_lock_noyield(pSpinlock: *mut ma_spinlock) -> ma_result;
}
extern "C" {
    pub fn ma_spinlock_unlock(pSpinlock: *mut ma_spinlock) -> ma_result;
}
extern "C" {
    pub fn ma_mutex_init(pMutex: *mut ma_mutex) -> ma_result;
}
extern "C" {
    pub fn ma_mutex_uninit(pMutex: *mut ma_mutex);
}
extern "C" {
    pub fn ma_mutex_lock(pMutex: *mut ma_mutex);
}
extern "C" {
    pub fn ma_mutex_unlock(pMutex: *mut ma_mutex);
}
extern "C" {
    pub fn ma_event_init(pEvent: *mut ma_event) -> ma_result;
}
extern "C" {
    pub fn ma_event_uninit(pEvent: *mut ma_event);
}
extern "C" {
    pub fn ma_event_wait(pEvent: *mut ma_event) -> ma_result;
}
extern "C" {
    pub fn ma_event_signal(pEvent: *mut ma_event) -> ma_result;
}
extern "C" {
    #[doc = "Utiltities"]
    pub fn ma_scale_buffer_size(baseBufferSize: ma_uint32, scale: f32) -> ma_uint32;
}
extern "C" {
    pub fn ma_calculate_buffer_size_in_milliseconds_from_frames(
        bufferSizeInFrames: ma_uint32,
        sampleRate: ma_uint32,
    ) -> ma_uint32;
}
extern "C" {
    pub fn ma_calculate_buffer_size_in_frames_from_milliseconds(
        bufferSizeInMilliseconds: ma_uint32,
        sampleRate: ma_uint32,
    ) -> ma_uint32;
}
extern "C" {
    pub fn ma_copy_pcm_frames(
        dst: *mut libc::c_void,
        src: *const libc::c_void,
        frameCount: ma_uint64,
        format: ma_format,
        channels: ma_uint32,
    );
}
extern "C" {
    pub fn ma_silence_pcm_frames(
        p: *mut libc::c_void,
        frameCount: ma_uint64,
        format: ma_format,
        channels: ma_uint32,
    );
}
extern "C" {
    pub fn ma_offset_pcm_frames_ptr(
        p: *mut libc::c_void,
        offsetInFrames: ma_uint64,
        format: ma_format,
        channels: ma_uint32,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn ma_offset_pcm_frames_const_ptr(
        p: *const libc::c_void,
        offsetInFrames: ma_uint64,
        format: ma_format,
        channels: ma_uint32,
    ) -> *const libc::c_void;
}
extern "C" {
    pub fn ma_clip_samples_f32(p: *mut f32, sampleCount: ma_uint64);
}
extern "C" {
    pub fn ma_copy_and_apply_volume_factor_u8(
        pSamplesOut: *mut ma_uint8,
        pSamplesIn: *const ma_uint8,
        sampleCount: ma_uint64,
        factor: f32,
    );
}
extern "C" {
    pub fn ma_copy_and_apply_volume_factor_s16(
        pSamplesOut: *mut ma_int16,
        pSamplesIn: *const ma_int16,
        sampleCount: ma_uint64,
        factor: f32,
    );
}
extern "C" {
    pub fn ma_copy_and_apply_volume_factor_s24(
        pSamplesOut: *mut libc::c_void,
        pSamplesIn: *const libc::c_void,
        sampleCount: ma_uint64,
        factor: f32,
    );
}
extern "C" {
    pub fn ma_copy_and_apply_volume_factor_s32(
        pSamplesOut: *mut ma_int32,
        pSamplesIn: *const ma_int32,
        sampleCount: ma_uint64,
        factor: f32,
    );
}
extern "C" {
    pub fn ma_copy_and_apply_volume_factor_f32(
        pSamplesOut: *mut f32,
        pSamplesIn: *const f32,
        sampleCount: ma_uint64,
        factor: f32,
    );
}
extern "C" {
    pub fn ma_apply_volume_factor_u8(pSamples: *mut ma_uint8, sampleCount: ma_uint64, factor: f32);
}
extern "C" {
    pub fn ma_apply_volume_factor_s16(pSamples: *mut ma_int16, sampleCount: ma_uint64, factor: f32);
}
extern "C" {
    pub fn ma_apply_volume_factor_s24(
        pSamples: *mut libc::c_void,
        sampleCount: ma_uint64,
        factor: f32,
    );
}
extern "C" {
    pub fn ma_apply_volume_factor_s32(pSamples: *mut ma_int32, sampleCount: ma_uint64, factor: f32);
}
extern "C" {
    pub fn ma_apply_volume_factor_f32(pSamples: *mut f32, sampleCount: ma_uint64, factor: f32);
}
extern "C" {
    pub fn ma_copy_and_apply_volume_factor_pcm_frames_u8(
        pPCMFramesOut: *mut ma_uint8,
        pPCMFramesIn: *const ma_uint8,
        frameCount: ma_uint64,
        channels: ma_uint32,
        factor: f32,
    );
}
extern "C" {
    pub fn ma_copy_and_apply_volume_factor_pcm_frames_s16(
        pPCMFramesOut: *mut ma_int16,
        pPCMFramesIn: *const ma_int16,
        frameCount: ma_uint64,
        channels: ma_uint32,
        factor: f32,
    );
}
extern "C" {
    pub fn ma_copy_and_apply_volume_factor_pcm_frames_s24(
        pPCMFramesOut: *mut libc::c_void,
        pPCMFramesIn: *const libc::c_void,
        frameCount: ma_uint64,
        channels: ma_uint32,
        factor: f32,
    );
}
extern "C" {
    pub fn ma_copy_and_apply_volume_factor_pcm_frames_s32(
        pPCMFramesOut: *mut ma_int32,
        pPCMFramesIn: *const ma_int32,
        frameCount: ma_uint64,
        channels: ma_uint32,
        factor: f32,
    );
}
extern "C" {
    pub fn ma_copy_and_apply_volume_factor_pcm_frames_f32(
        pPCMFramesOut: *mut f32,
        pPCMFramesIn: *const f32,
        frameCount: ma_uint64,
        channels: ma_uint32,
        factor: f32,
    );
}
extern "C" {
    pub fn ma_copy_and_apply_volume_factor_pcm_frames(
        pFramesOut: *mut libc::c_void,
        pFramesIn: *const libc::c_void,
        frameCount: ma_uint64,
        format: ma_format,
        channels: ma_uint32,
        factor: f32,
    );
}
extern "C" {
    pub fn ma_apply_volume_factor_pcm_frames_u8(
        pFrames: *mut ma_uint8,
        frameCount: ma_uint64,
        channels: ma_uint32,
        factor: f32,
    );
}
extern "C" {
    pub fn ma_apply_volume_factor_pcm_frames_s16(
        pFrames: *mut ma_int16,
        frameCount: ma_uint64,
        channels: ma_uint32,
        factor: f32,
    );
}
extern "C" {
    pub fn ma_apply_volume_factor_pcm_frames_s24(
        pFrames: *mut libc::c_void,
        frameCount: ma_uint64,
        channels: ma_uint32,
        factor: f32,
    );
}
extern "C" {
    pub fn ma_apply_volume_factor_pcm_frames_s32(
        pFrames: *mut ma_int32,
        frameCount: ma_uint64,
        channels: ma_uint32,
        factor: f32,
    );
}
extern "C" {
    pub fn ma_apply_volume_factor_pcm_frames_f32(
        pFrames: *mut f32,
        frameCount: ma_uint64,
        channels: ma_uint32,
        factor: f32,
    );
}
extern "C" {
    pub fn ma_apply_volume_factor_pcm_frames(
        pFrames: *mut libc::c_void,
        frameCount: ma_uint64,
        format: ma_format,
        channels: ma_uint32,
        factor: f32,
    );
}
extern "C" {
    pub fn ma_factor_to_gain_db(factor: f32) -> f32;
}
extern "C" {
    pub fn ma_gain_db_to_factor(gain: f32) -> f32;
}
pub type ma_data_source = libc::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_data_source_callbacks {
    pub onRead: ::core::option::Option<
        unsafe extern "C" fn(
            pDataSource: *mut ma_data_source,
            pFramesOut: *mut libc::c_void,
            frameCount: ma_uint64,
            pFramesRead: *mut ma_uint64,
        ) -> ma_result,
    >,
    pub onSeek: ::core::option::Option<
        unsafe extern "C" fn(pDataSource: *mut ma_data_source, frameIndex: ma_uint64) -> ma_result,
    >,
    pub onMap: ::core::option::Option<
        unsafe extern "C" fn(
            pDataSource: *mut ma_data_source,
            ppFramesOut: *mut *mut libc::c_void,
            pFrameCount: *mut ma_uint64,
        ) -> ma_result,
    >,
    pub onUnmap: ::core::option::Option<
        unsafe extern "C" fn(pDataSource: *mut ma_data_source, frameCount: ma_uint64) -> ma_result,
    >,
    pub onGetDataFormat: ::core::option::Option<
        unsafe extern "C" fn(
            pDataSource: *mut ma_data_source,
            pFormat: *mut ma_format,
            pChannels: *mut ma_uint32,
            pSampleRate: *mut ma_uint32,
        ) -> ma_result,
    >,
    pub onGetCursor: ::core::option::Option<
        unsafe extern "C" fn(
            pDataSource: *mut ma_data_source,
            pCursor: *mut ma_uint64,
        ) -> ma_result,
    >,
    pub onGetLength: ::core::option::Option<
        unsafe extern "C" fn(
            pDataSource: *mut ma_data_source,
            pLength: *mut ma_uint64,
        ) -> ma_result,
    >,
}
#[test]
fn bindgen_test_layout_ma_data_source_callbacks() {
    assert_eq!(
        ::core::mem::size_of::<ma_data_source_callbacks>(),
        56usize,
        concat!("Size of: ", stringify!(ma_data_source_callbacks))
    );
    assert_eq!(
        ::core::mem::align_of::<ma_data_source_callbacks>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_data_source_callbacks))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_source_callbacks>())).onRead as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_callbacks),
            "::",
            stringify!(onRead)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_source_callbacks>())).onSeek as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_callbacks),
            "::",
            stringify!(onSeek)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ma_data_source_callbacks>())).onMap as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_callbacks),
            "::",
            stringify!(onMap)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ma_data_source_callbacks>())).onUnmap as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ma_data_source_callbacks),
            "::",
            stringify!(onUnmap)
        )
    );
    assert_eq!(
        unsafe {
